emacs/init.org
#+HTML_HEAD: <meta charset='utf-8'></meta>
#+HTML_HEAD: <link rel="stylesheet" href="https://rawgit.com/simonced/css/master/markdown.css" />
#+PROPERTY: header-args :eval never-export
#+STARTUP: content showblocks
#+TITLE: My Emacs configuration file

* Before starting
:PROPERTIES:
:CUSTOM_ID: before-starting
:END:
Here is the way I call that config on local computers:

: (package-initialize)
: (add-to-list 'load-path "~/git/dotfiles/emacs/")
: (org-babel-load-file "~/git/dotfiles/emacs/init.org")

* Path and such
#+BEGIN_SRC emacs-lisp
(setq backup-directory-alist `((".*" . ,temporary-file-directory)))
#+END_SRC
* Packages
** Repos
Found on [[http://melpa.org/#/getting-started][Melpa]].

#+BEGIN_SRC emacs-lisp
  (require 'package) ;; You might already have this line
  (add-to-list 'package-archives
               '("org" . "http://orgmode.org/elpa/") t)
  (add-to-list 'package-archives
               '("melpa" . "http://melpa.org/packages/") t)
  (package-initialize) ;; You might already have this line
#+END_SRC

-----

Utility function (auto download of missing packages): [[http://stackoverflow.com/a/10095853/921796][Reference]]

#+BEGIN_SRC emacs-lisp
(defun ensure-package-installed (&rest packages)
  "Assure every package is installed, ask for installation if it’s not.

Return a list of installed packages or nil for every skipped package."
  (mapcar
   (lambda (package)
     ;; (package-installed-p 'evil)
     (unless (package-installed-p package)
       (package-install package)))
     packages)
)

;; make sure to have downloaded archive description.
;; Or use package-archive-contents as suggested by Nicolas Dudebout
(or (file-exists-p package-user-dir)
  (package-refresh-contents))
#+END_SRC
** My selection
#+BEGIN_SRC emacs-lisp
;; simply add package names to the list
(ensure-package-installed
 ;; === UI utilities ===
 'helm
 'swiper
 'flx-ido
 'projectile
 'helm-projectile
 ;; === Text Utilities ===
 'company
 'company-web
 ;; 'auto-complete                      ; This is for php-eldoc
 'multiple-cursors
 'goto-last-change
 'helm-company
 ;; === Web related ===
 'apache-mode
 'web-mode
 ;; 'php-mode
 ;; 'ob-php                             ; php in org files
 ;; 'php-eldoc
 ;; 'ac-php                             ; Works with company as well
 'emmet-mode
 'js2-mode
 ;; === Elixir relater ===
 'alchemist
 'ob-elixir
 ;; === Lisp related ===
 'rainbow-delimiters
 'rainbow-mode
 'eldoc
 'paredit
 ;; 'dot-mode
 ;; === Org related ===
 'org
 'htmlize
 'org-bullets
 ;; === Tools ===
 'exec-path-from-shell
 ;; 'powerline
 ;; 'folding
 ;; 'nyan-mode
 ;; === Themes ===
 'color-theme
 'cyberpunk-theme
 )

;; if <24.4 do not include magit in the packages
(if (not (version< emacs-version "24.4"))
	(ensure-package-installed
	 ;; === Git utilities ===
	 'magit
	 'git-gutter
	 )
  )
#+END_SRC

#+RESULTS:

** Projectile related
#+BEGIN_SRC emacs-lisp
(projectile-mode)
#+END_SRC
** Multiple cursors related
#+BEGIN_SRC emacs-lisp
(require 'multiple-cursors)
(global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
#+END_SRC
