emacs/init.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-08-03 æœ¨ 12:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Emacs configuration file</title>
<meta name="generator" content="Org mode" />
<meta charset='utf-8'></meta>
<link rel="stylesheet" href="https://rawgit.com/simonced/css/master/markdown.css" />
</head>
<body>
<div id="content">
<h1 class="title">My Emacs configuration file</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#before-starting">Before starting</a></li>
<li><a href="#orgce5126d">Path and such</a></li>
<li><a href="#orgc7d3491">Packages</a>
<ul>
<li><a href="#orgcd8ee57">Repos</a></li>
<li><a href="#org584328e">My selection</a></li>
<li><a href="#orgf131a96">Projectile related</a></li>
<li><a href="#org18560c3">Multiple cursors related</a></li>
<li><a href="#orga71e6e1">Company related</a></li>
<li><a href="#org871756b">Helm OR Ivy related</a>
<ul>
<li><a href="#orga7b4438">Helm part</a></li>
<li><a href="#org91b7446">Ivy part</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org201d6ff">My functions</a>
<ul>
<li><a href="#org6e4d356">My Diary lib</a></li>
<li><a href="#org3d5d06f">Org related</a></li>
<li><a href="#orgb2a03d6">SQL related</a></li>
<li><a href="#org3df607f">HTML related</a>
<ul>
<li><a href="#org9ae4bd8">Ruby tag</a></li>
</ul>
</li>
<li><a href="#org2adf478"><span class="todo TODO">TODO</span> Misc&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cleanup">cleanup</span>&#xa0;<span class="split">split</span></span></a></li>
<li><a href="#org7d5376c">Text decoding</a>
<ul>
<li><a href="#orgb617f55">Base64 -&gt; utf-8</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org97ec8be">INIT</a>
<ul>
<li><a href="#org1b0ea05">Global settings</a></li>
<li><a href="#org791df97">Status Bar related</a></li>
<li><a href="#org1b202a8">Search + Selection related</a></li>
<li><a href="#org7f4c90e">Display related</a></li>
<li><a href="#orgeb547b9">Git related</a></li>
<li><a href="#orgcde710e">Grep related</a></li>
<li><a href="#org6f3332a">Files and Buffers related</a></li>
<li><a href="#org7305363">Default scratch buffer</a></li>
<li><a href="#orge98449d">Shortcuts</a></li>
<li><a href="#org867d48c"><span class="todo TODO">TODO</span> Completion/Hippie/Ido&#xa0;&#xa0;&#xa0;<span class="tag"><span class="fixme">fixme</span></span></a></li>
</ul>
</li>
<li><a href="#orgdea6dc2">System specific</a>
<ul>
<li><a href="#org8986b44">Windows</a></li>
</ul>
</li>
<li><a href="#org1636e75">Programing</a>
<ul>
<li><a href="#org593d47b">General</a></li>
<li><a href="#org3ee25b7">WEB related</a></li>
<li><a href="#orgd1f6d9b">(e)Lisp related</a></li>
</ul>
</li>
<li><a href="#orgbc75d47"><span class="todo TODO">TODO</span> Org related (big section)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cleanup">cleanup</span></span></a>
<ul>
<li><a href="#org36c346d">Capture</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org34bcfff" class="outline-2">
<h2 id="before-starting"><a id="org34bcfff"></a>Before starting</h2>
<div class="outline-text-2" id="text-before-starting">
<p>
Here is the way I call that config on local computers:
</p>

<pre class="example">
(package-initialize)
(add-to-list 'load-path "~/git/dotfiles/emacs/")
(org-babel-load-file "~/git/dotfiles/emacs/init.org")

</pre>
</div>
</div>

<div id="outline-container-orgce5126d" class="outline-2">
<h2 id="orgce5126d">Path and such</h2>
<div class="outline-text-2" id="text-orgce5126d">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> backup-directory-alist `<span style="color: #9FA8DA;">(</span><span style="color: #00B8D4;">(</span><span style="color: #66BB6A;">".*"</span> . ,temporary-file-directory<span style="color: #00B8D4;">)</span><span style="color: #9FA8DA;">)</span><span style="color: #B388FF;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc7d3491" class="outline-2">
<h2 id="orgc7d3491">Packages</h2>
<div class="outline-text-2" id="text-orgc7d3491">
</div><div id="outline-container-orgcd8ee57" class="outline-3">
<h3 id="orgcd8ee57">Repos</h3>
<div class="outline-text-3" id="text-orgcd8ee57">
<p>
Found on <a href="http://melpa.org/#/getting-started">Melpa</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #B388FF;">(</span><span style="color: #7E57C2;">require</span> '<span style="color: #5C6BC0;">package</span><span style="color: #B388FF;">)</span> <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">You might already have this line</span>
  <span style="color: #B388FF;">(</span>add-to-list 'package-archives
               '<span style="color: #9FA8DA;">(</span><span style="color: #66BB6A;">"org"</span> . <span style="color: #66BB6A;">"http://orgmode.org/elpa/"</span><span style="color: #9FA8DA;">)</span> t<span style="color: #B388FF;">)</span>
  <span style="color: #B388FF;">(</span>add-to-list 'package-archives
               '<span style="color: #9FA8DA;">(</span><span style="color: #66BB6A;">"melpa"</span> . <span style="color: #66BB6A;">"http://melpa.org/packages/"</span><span style="color: #9FA8DA;">)</span> t<span style="color: #B388FF;">)</span>
  <span style="color: #B388FF;">(</span>package-initialize<span style="color: #B388FF;">)</span> <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">You might already have this line</span>
</pre>
</div>

<hr />

<p>
Utility function (auto download of missing packages): <a href="http://stackoverflow.com/a/10095853/921796">Reference</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">ensure-package-installed</span> <span style="color: #9FA8DA;">(</span><span style="color: #D84315;">&amp;rest</span> packages<span style="color: #9FA8DA;">)</span>
  <span style="color: #78909C;">"Assure every package is installed, ask for installation if it&#8217;s not.</span>

<span style="color: #78909C;">Return a list of installed packages or nil for every skipped package."</span>
  <span style="color: #9FA8DA;">(</span>mapcar
   <span style="color: #00B8D4;">(</span><span style="color: #7E57C2;">lambda</span> <span style="color: #1E88E5;">(</span>package<span style="color: #1E88E5;">)</span>
     <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">(package-installed-p 'evil)</span>
     <span style="color: #1E88E5;">(</span><span style="color: #7E57C2;">unless</span> <span style="color: #00897B;">(</span>package-installed-p package<span style="color: #00897B;">)</span>
       <span style="color: #00897B;">(</span>package-install package<span style="color: #00897B;">)</span><span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span>
     packages<span style="color: #9FA8DA;">)</span>
<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">make sure to have downloaded archive description.</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">Or use package-archive-contents as suggested by Nicolas Dudebout</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">or</span> <span style="color: #9FA8DA;">(</span>file-exists-p package-user-dir<span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>package-refresh-contents<span style="color: #9FA8DA;">)</span><span style="color: #B388FF;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org584328e" class="outline-3">
<h3 id="org584328e">My selection</h3>
<div class="outline-text-3" id="text-org584328e">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">simply add package names to the list</span>
<span style="color: #B388FF;">(</span>ensure-package-installed
 <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">=== UI utilities ===</span>
 'helm
 'swiper
 'flx-ido
 'projectile
 'helm-projectile
 <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">=== Text Utilities ===</span>
 'company
 'company-web
 <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">'auto-complete                      ; This is for php-eldoc</span>
 'multiple-cursors
 'goto-last-change
 'helm-company
 <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">=== Web related ===</span>
 'apache-mode
 'web-mode
 <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">'php-mode</span>
 <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">'ob-php                             ; php in org files</span>
 <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">'php-eldoc</span>
 <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">'ac-php                             ; Works with company as well</span>
 'emmet-mode
 'js2-mode
 <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">=== Elixir relater ===</span>
 'alchemist
 'ob-elixir
 <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">=== Lisp related ===</span>
 'rainbow-delimiters
 'rainbow-mode
 'eldoc
 'paredit
 <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">'dot-mode</span>
 <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">=== Org related ===</span>
 'org
 'htmlize
 'org-bullets
 <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">=== Tools ===</span>
 'exec-path-from-shell
 'avy
 <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">'powerline</span>
 <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">'folding</span>
 <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">'nyan-mode</span>
 <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">=== Themes ===</span>
 'color-theme
 'cyberpunk-theme
 <span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">if &lt;24.4 do not include magit in the packages</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">if</span> <span style="color: #9FA8DA;">(</span>not <span style="color: #00B8D4;">(</span>version&lt; emacs-version <span style="color: #66BB6A;">"24.4"</span><span style="color: #00B8D4;">)</span><span style="color: #9FA8DA;">)</span>
    <span style="color: #9FA8DA;">(</span>ensure-package-installed
     <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">=== Git utilities ===</span>
     'magit
     'git-gutter
     <span style="color: #9FA8DA;">)</span>
  <span style="color: #B388FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf131a96" class="outline-3">
<h3 id="orgf131a96">Projectile related</h3>
<div class="outline-text-3" id="text-orgf131a96">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #B388FF;">(</span>projectile-mode<span style="color: #B388FF;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org18560c3" class="outline-3">
<h3 id="org18560c3">Multiple cursors related</h3>
<div class="outline-text-3" id="text-org18560c3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #B388FF;">(</span><span style="color: #7E57C2;">require</span> '<span style="color: #5C6BC0;">multiple-cursors</span><span style="color: #B388FF;">)</span>
<span style="color: #B388FF;">(</span>global-set-key <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"C-S-c C-S-c"</span><span style="color: #9FA8DA;">)</span> 'mc/edit-lines<span style="color: #B388FF;">)</span>
</pre>
</div>
</div>
</div>
