emacs/init.org
** Company related
#+BEGIN_SRC emacs-lisp
(require 'company)
(global-company-mode)

;; Files completion
(require 'company-files)
(global-set-key (kbd "C-c f") 'company-files)

;; Completion related
(global-set-key (kbd "TAB") 'company-indent-or-complete-common)

;; no company with php-mode, because it switches to tags completion
;; and I don't use tags with Emacs anyway...
(add-hook 'php-mode-hook '(lambda () (company-mode -1)))

;; using company to complete org keywords?
(eval-after-load 'company
  '(add-to-list 'company-backends 'company-capf))
#+END_SRC
** Helm OR Ivy related
Because I want to try/compare Helm with Ivy, here I define 2 functions to lunch one setup or the other.
*** Helm part
Packages required:
- helm
- helm-projectile

#+BEGIN_SRC emacs-lisp
(defun ced/i-use-helm ()
  "Function to init Helm when I decide to use it."
  (interactive)
  (helm-mode)
  ;; keys
  (global-set-key (kbd "C-x M-f") 'helm-recentf)
  (global-set-key (kbd "C-x b")   'helm-buffers-list)
  (global-set-key (kbd "C-x C-b") 'ido-switch-buffer)
  (global-set-key (kbd "M-x")     'helm-M-x)
  (global-set-key (kbd "C-x f")   'helm-find-files)
  (global-set-key (kbd "C-c b")   'helm-bookmarks)

  ;; helm for projectile
  (require 'helm-projectile)
  (helm-projectile-on)
  )
#+END_SRC

*** Ivy part
Packages required:
- ivy
- counsel

#+BEGIN_SRC emacs-lisp
(defun ced/i-use-ivy ()
  "Function to init Ivy when I decide to use it."
  (interactive)
  (ivy-mode)
  (setq ivy-use-virtual-buffers t)
  ;; no regexp by default
  (setq ivy-initial-inputs-alist nil)
  ;; keys
  (global-set-key (kbd "C-x b")   'ivy-switch-buffer)
  (global-set-key (kbd "C-x C-b") 'ido-switch-buffer)
  (global-set-key (kbd "M-x")     'counsel-M-x)
  (global-set-key (kbd "C-x f")   'counsel-find-file)
  ;; integration with other plugins
  (when (require 'magit nil 'noerror)
	(setq magit-completing-read-function 'ivy-completing-read)
	)
  (when (require 'projectile nil 'noerror)
	(setq projectile-completion-system 'ivy)
	)  
  )
#+END_SRC

* My functions
#+BEGIN_QUOTE
Trying to be consistent, all functions should start with "ced/"
#+END_QUOTE
** My Diary lib
This requires that ~load-path~ is pointing to the correct directory.\\
See [[#before-starting][Before starting]] section for reference.

#+BEGIN_SRC emacs-lisp
;; my new diary "package" (move in my main config once working as I want)
(load-library "ced-diary.el")
#+END_SRC
