emacs/init.html
<div id="outline-container-orga71e6e1" class="outline-3">
<h3 id="orga71e6e1">Company related</h3>
<div class="outline-text-3" id="text-orga71e6e1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #B388FF;">(</span><span style="color: #7E57C2;">require</span> '<span style="color: #5C6BC0;">company</span><span style="color: #B388FF;">)</span>
<span style="color: #B388FF;">(</span>global-company-mode<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">Files completion</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">require</span> '<span style="color: #5C6BC0;">company-files</span><span style="color: #B388FF;">)</span>
<span style="color: #B388FF;">(</span>global-set-key <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"C-c f"</span><span style="color: #9FA8DA;">)</span> 'company-files<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">Completion related</span>
<span style="color: #B388FF;">(</span>global-set-key <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"TAB"</span><span style="color: #9FA8DA;">)</span> 'company-indent-or-complete-common<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">no company with php-mode, because it switches to tags completion</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">and I don't use tags with Emacs anyway...</span>
<span style="color: #B388FF;">(</span>add-hook 'php-mode-hook '<span style="color: #9FA8DA;">(</span>lambda <span style="color: #00B8D4;">()</span> <span style="color: #00B8D4;">(</span>company-mode -1<span style="color: #00B8D4;">)</span><span style="color: #9FA8DA;">)</span><span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">using company to complete org keywords?</span>
<span style="color: #B388FF;">(</span>eval-after-load 'company
  '<span style="color: #9FA8DA;">(</span>add-to-list 'company-backends 'company-capf<span style="color: #9FA8DA;">)</span><span style="color: #B388FF;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org871756b" class="outline-3">
<h3 id="org871756b">Helm OR Ivy related</h3>
<div class="outline-text-3" id="text-org871756b">
<p>
Because I want to try/compare Helm with Ivy, here I define 2 functions to lunch one setup or the other.
</p>
</div>
<div id="outline-container-orga7b4438" class="outline-4">
<h4 id="orga7b4438">Helm part</h4>
<div class="outline-text-4" id="text-orga7b4438">
<p>
Packages required:
</p>
<ul class="org-ul">
<li>helm</li>
<li>helm-projectile</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">ced/i-use-helm</span> <span style="color: #9FA8DA;">()</span>
  <span style="color: #78909C;">"Function to init Helm when I decide to use it."</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">interactive</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>helm-mode<span style="color: #9FA8DA;">)</span>
  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">keys</span>
  <span style="color: #9FA8DA;">(</span>global-set-key <span style="color: #00B8D4;">(</span>kbd <span style="color: #66BB6A;">"C-x M-f"</span><span style="color: #00B8D4;">)</span> 'helm-recentf<span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>global-set-key <span style="color: #00B8D4;">(</span>kbd <span style="color: #66BB6A;">"C-x b"</span><span style="color: #00B8D4;">)</span>   'helm-buffers-list<span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>global-set-key <span style="color: #00B8D4;">(</span>kbd <span style="color: #66BB6A;">"C-x C-b"</span><span style="color: #00B8D4;">)</span> 'ido-switch-buffer<span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>global-set-key <span style="color: #00B8D4;">(</span>kbd <span style="color: #66BB6A;">"M-x"</span><span style="color: #00B8D4;">)</span>     'helm-M-x<span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>global-set-key <span style="color: #00B8D4;">(</span>kbd <span style="color: #66BB6A;">"C-x f"</span><span style="color: #00B8D4;">)</span>   'helm-find-files<span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>global-set-key <span style="color: #00B8D4;">(</span>kbd <span style="color: #66BB6A;">"C-c b"</span><span style="color: #00B8D4;">)</span>   'helm-bookmarks<span style="color: #9FA8DA;">)</span>

  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">helm for projectile</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">require</span> '<span style="color: #5C6BC0;">helm-projectile</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>helm-projectile-on<span style="color: #9FA8DA;">)</span>
  <span style="color: #B388FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org91b7446" class="outline-4">
<h4 id="org91b7446">Ivy part</h4>
<div class="outline-text-4" id="text-org91b7446">
<p>
Packages required:
</p>
<ul class="org-ul">
<li>ivy</li>
<li>counsel</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">ced/i-use-ivy</span> <span style="color: #9FA8DA;">()</span>
  <span style="color: #78909C;">"Function to init Ivy when I decide to use it."</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">interactive</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>ivy-mode<span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">setq</span> ivy-use-virtual-buffers t<span style="color: #9FA8DA;">)</span>
  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">no regexp by default</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">setq</span> ivy-initial-inputs-alist nil<span style="color: #9FA8DA;">)</span>
  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">keys</span>
  <span style="color: #9FA8DA;">(</span>global-set-key <span style="color: #00B8D4;">(</span>kbd <span style="color: #66BB6A;">"C-x b"</span><span style="color: #00B8D4;">)</span>   'ivy-switch-buffer<span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>global-set-key <span style="color: #00B8D4;">(</span>kbd <span style="color: #66BB6A;">"C-x C-b"</span><span style="color: #00B8D4;">)</span> 'ido-switch-buffer<span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>global-set-key <span style="color: #00B8D4;">(</span>kbd <span style="color: #66BB6A;">"M-x"</span><span style="color: #00B8D4;">)</span>     'counsel-M-x<span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>global-set-key <span style="color: #00B8D4;">(</span>kbd <span style="color: #66BB6A;">"C-x f"</span><span style="color: #00B8D4;">)</span>   'counsel-find-file<span style="color: #9FA8DA;">)</span>
  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">integration with other plugins</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">when</span> <span style="color: #00B8D4;">(</span><span style="color: #7E57C2;">require</span> '<span style="color: #5C6BC0;">magit</span> nil 'noerror<span style="color: #00B8D4;">)</span>
    <span style="color: #00B8D4;">(</span><span style="color: #7E57C2;">setq</span> magit-completing-read-function 'ivy-completing-read<span style="color: #00B8D4;">)</span>
    <span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">when</span> <span style="color: #00B8D4;">(</span><span style="color: #7E57C2;">require</span> '<span style="color: #5C6BC0;">projectile</span> nil 'noerror<span style="color: #00B8D4;">)</span>
    <span style="color: #00B8D4;">(</span><span style="color: #7E57C2;">setq</span> projectile-completion-system 'ivy<span style="color: #00B8D4;">)</span>
    <span style="color: #9FA8DA;">)</span>  
  <span style="color: #B388FF;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org201d6ff" class="outline-2">
<h2 id="org201d6ff">My functions</h2>
<div class="outline-text-2" id="text-org201d6ff">
<blockquote>
<p>
Trying to be consistent, all functions should start with "ced/"
</p>
</blockquote>
</div>
<div id="outline-container-org6e4d356" class="outline-3">
<h3 id="org6e4d356">My Diary lib</h3>
<div class="outline-text-3" id="text-org6e4d356">
<p>
This requires that <code>load-path</code> is pointing to the correct directory.<br />
See <a href="#before-starting">Before starting</a> section for reference.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">my new diary "package" (move in my main config once working as I want)</span>
<span style="color: #B388FF;">(</span>load-library <span style="color: #66BB6A;">"ced-diary.el"</span><span style="color: #B388FF;">)</span>
</pre>
</div>
</div>
</div>
