emacs/init.html
<div id="outline-container-org3d5d06f" class="outline-3">
<h3 id="org3d5d06f">Org related</h3>
<div class="outline-text-3" id="text-org3d5d06f">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">to use shell as code blocks, a lib in my dotfiels/emacs folder has to be loaded</span>
<span style="color: #B388FF;">(</span>load-library <span style="color: #66BB6A;">"ob-shell"</span><span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">same but used to insert timestamp in org files at export</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">used in conjonction with</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">-*- org-export-babel-evaluate: t -*-</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">at the top of the related files</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">so it exports everything automatically</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">ced/org-today</span> <span style="color: #9FA8DA;">()</span>
  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">(interactive)</span>
  <span style="color: #9FA8DA;">(</span>print <span style="color: #00B8D4;">(</span>format <span style="color: #66BB6A;">"Update : %s"</span> <span style="color: #1E88E5;">(</span>format-time-string <span style="color: #66BB6A;">"%F"</span> nil<span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #B388FF;">)</span>


<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">ced/org-drawer-format</span> <span style="color: #9FA8DA;">(</span>name contents<span style="color: #9FA8DA;">)</span>
  <span style="color: #78909C;">"Formating `PARAMS` drawers entries at html export.</span>
<span style="color: #78909C;">Only the drawers with ':export: t' will have their data exported in html"</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">when</span> <span style="color: #00B8D4;">(</span><span style="color: #7E57C2;">and</span> <span style="color: #1E88E5;">(</span>equal name <span style="color: #66BB6A;">"PARAMS"</span><span style="color: #1E88E5;">)</span> <span style="color: #1E88E5;">(</span>string-match <span style="color: #66BB6A;">":export:\s+t"</span> contents<span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span>
    <span style="color: #00B8D4;">(</span><span style="color: #7E57C2;">let</span> <span style="color: #1E88E5;">(</span>mycontent<span style="color: #1E88E5;">)</span>
      <span style="color: #1E88E5;">(</span><span style="color: #7E57C2;">setq</span> mycontent <span style="color: #00897B;">(</span>replace-regexp-in-string <span style="color: #66BB6A;">":export:.*t\n?"</span> <span style="color: #66BB6A;">""</span> contents<span style="color: #00897B;">)</span><span style="color: #1E88E5;">)</span>
      <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">(message mycontent)</span>
      <span style="color: #1E88E5;">(</span>replace-regexp-in-string <span style="color: #66BB6A;">":</span><span style="color: #B388FF;">\\</span><span style="color: #B388FF;">(</span><span style="color: #66BB6A;">.*?</span><span style="color: #B388FF;">\\</span><span style="color: #B388FF;">)</span><span style="color: #66BB6A;">:</span><span style="color: #B388FF;">\\</span><span style="color: #B388FF;">(</span><span style="color: #66BB6A;">.*</span><span style="color: #B388FF;">\\</span><span style="color: #B388FF;">)</span><span style="color: #66BB6A;">\n?"</span> <span style="color: #66BB6A;">"&lt;b&gt;\\1&lt;/b&gt;:\\2&lt;br&gt;"</span> mycontent<span style="color: #1E88E5;">)</span>
      <span style="color: #00B8D4;">)</span>
    <span style="color: #9FA8DA;">)</span>
  <span style="color: #B388FF;">)</span>

<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> org-html-format-drawer-function 'ced/org-drawer-format<span style="color: #B388FF;">)</span>


<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">ced/org-image-display</span> <span style="color: #9FA8DA;">()</span>
  <span style="color: #78909C;">"Simple function that displays only the inline picture on the line at point"</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">interactive</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>org-display-inline-images t nil <span style="color: #00B8D4;">(</span>line-beginning-position<span style="color: #00B8D4;">)</span> <span style="color: #00B8D4;">(</span>line-end-position<span style="color: #00B8D4;">)</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #B388FF;">)</span>


<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">To be used in an org source block for example, like in the sample below</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">careful, it seems that even simple lists of items are passed as 2-dimension lists</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">so we need to apply [,0] to extract all rows of the column at index 0</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">(the first and only data we have and want)</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">Can be used with more complex tables of data if needed...</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">ced/org-highlight-list</span> <span style="color: #9FA8DA;">(</span>list_<span style="color: #9FA8DA;">)</span>
  <span style="color: #78909C;">" Simply highlight all words from a list.</span>
<span style="color: #78909C;">Typical use is in an org file, with a named list or table (single column).</span>
<span style="color: #78909C;">Sample:</span>

<span style="color: #78909C;">#+name: mylist</span>
<span style="color: #78909C;">- word1</span>
<span style="color: #78909C;">- word2</span>
<span style="color: #78909C;">- word3</span>
<span style="color: #78909C;">- word4</span>

<span style="color: #78909C;">BEGIN_SRC emacs-lisp :var list=mylist[,0]</span>
<span style="color: #78909C;">(ced/org-highlight-list list)</span>
<span style="color: #78909C;">END_SRC</span>

<span style="color: #78909C;">Note: The example above might get a little funky with Japanese text, use a table instead of a list can help.</span>
<span style="color: #78909C;">"</span>
  <span style="color: #9FA8DA;">(</span>unhighlight-regexp t<span style="color: #9FA8DA;">)</span>                <span style="color: #90A4AE;">;</span><span style="color: #bebebe; font-style: italic;">clear previous highlight if any</span>
  <span style="color: #9FA8DA;">(</span>highlight-regexp
       <span style="color: #00B8D4;">(</span>mapconcat 'identity list_ <span style="color: #66BB6A;">"</span><span style="color: #B388FF;">\\</span><span style="color: #B388FF;">|</span><span style="color: #66BB6A;">"</span><span style="color: #00B8D4;">)</span><span style="color: #9FA8DA;">)</span> <span style="color: #90A4AE;">;</span><span style="color: #bebebe; font-style: italic;">highlight the terms in the list</span>
  <span style="color: #9FA8DA;">(</span>mapconcat 'identity list_ <span style="color: #66BB6A;">","</span><span style="color: #9FA8DA;">)</span>         <span style="color: #90A4AE;">;</span><span style="color: #bebebe; font-style: italic;">return the list of keywords for external usage</span>
  <span style="color: #B388FF;">)</span>


<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">As of org-mode 9, the value above has another behavior when set to `nil`.</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">Code blocks will all be exported, despite setting :exports results at code blocks.</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">The solution is to leave that value to `t` and use the header property below at the top of document:</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">#+PROPERTY: header-args :eval never-export</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">simple bootstrap header for when I start with a new org file</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">ced/org-new</span> <span style="color: #9FA8DA;">()</span>
  <span style="color: #78909C;">"</span>
<span style="color: #78909C;">Simply insert some defaults I use all the time in my org files</span>
<span style="color: #78909C;">"</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">interactive</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">save-excursion</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>insert <span style="color: #66BB6A;">"#+HTML_HEAD: &lt;meta charset='utf-8'&gt;&lt;/meta&gt;</span>
<span style="color: #66BB6A;">#+HTML_HEAD: &lt;link rel=\"stylesheet\" href=\"https://rawgit.com/simonced/css/master/markdown.css\" /&gt;</span>
<span style="color: #66BB6A;">#+PROPERTY: header-args :eval never-export</span>
<span style="color: #66BB6A;">#+TITLE: &lt;TODO&gt;</span>
<span style="color: #66BB6A;">"</span><span style="color: #9FA8DA;">)</span>
<span style="color: #B388FF;">)</span>

</pre>
</div>
</div>
</div>
