emacs/init.org
** SQL related
#+BEGIN_SRC emacs-lisp
;; Function that makes the post http request
(defun url-http-post (url args)
  "
Send ARGS to URL as a POST request.
Found here:
http://qiita.com/sanryuu/items/eed79c7b99616e769e67
"
  (let (
        (response-string nil)
        (url-request-method "POST")
        (url-request-extra-headers
         '(("Content-Type" . "application/x-www-form-urlencoded")))
        (url-request-data
         (mapconcat (lambda (arg)
                      (concat (url-hexify-string (car arg))
                              "="
                              (url-hexify-string (cdr arg))))
                    args
                    "&")))
    (switch-to-buffer
     (url-retrieve-synchronously url))
    (goto-char (point-min))
    (re-search-forward "\n\n")
    (setq response-string
          (buffer-substring-no-properties (point) (point-max)))
    (kill-buffer (current-buffer))
    response-string)
  )

;; ======================================================================

(defun sql-query-format (query)
  "We use sqlformat.org API to format QUERY given as parameter"
  (setq answer
		(url-http-post "https://sqlformat.org/api/v1/format"
					   ;; Here the trick is to use the ` to force to parse the
					   ;; ,query parameter (note the , before!)
					   `(("sql" . ,query)
						 ("reindent" . "1"))
					   )
		)
  (cdr (assoc 'result (json-read-from-string answer)))
)

;; ======================================================================

;; Testing our function with simple lisp
;;(sql-query-format "select * from users where email='test@example.com'")

;; Getting a query from the buffer
(defun ced/sql-query-format-paragraph ()
  "We take the current paragraph as a query and format it."
  (interactive)
  (save-excursion
	(progn
	  (backward-paragraph)
	  (set-mark (point))
	  (forward-paragraph)
	  (setq query (buffer-substring-no-properties (mark) (point)))
	  (setq query-formated (sql-query-format query))
	  (kill-region (mark) (point))
	  (insert query-formated)
	  )
	)
  )
#+END_SRC

