emacs/init.html
<div id="outline-container-orgb2a03d6" class="outline-3">
<h3 id="orgb2a03d6">SQL related</h3>
<div class="outline-text-3" id="text-orgb2a03d6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">Function that makes the post http request</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">url-http-post</span> <span style="color: #9FA8DA;">(</span>url args<span style="color: #9FA8DA;">)</span>
  <span style="color: #78909C;">"</span>
<span style="color: #78909C;">Send ARGS to URL as a POST request.</span>
<span style="color: #78909C;">Found here:</span>
<span style="color: #78909C;">http://qiita.com/sanryuu/items/eed79c7b99616e769e67</span>
<span style="color: #78909C;">"</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">let</span> <span style="color: #00B8D4;">(</span>
        <span style="color: #1E88E5;">(</span>response-string nil<span style="color: #1E88E5;">)</span>
        <span style="color: #1E88E5;">(</span>url-request-method <span style="color: #66BB6A;">"POST"</span><span style="color: #1E88E5;">)</span>
        <span style="color: #1E88E5;">(</span>url-request-extra-headers
         '<span style="color: #00897B;">(</span><span style="color: #EC407A;">(</span><span style="color: #66BB6A;">"Content-Type"</span> . <span style="color: #66BB6A;">"application/x-www-form-urlencoded"</span><span style="color: #EC407A;">)</span><span style="color: #00897B;">)</span><span style="color: #1E88E5;">)</span>
        <span style="color: #1E88E5;">(</span>url-request-data
         <span style="color: #00897B;">(</span>mapconcat <span style="color: #EC407A;">(</span><span style="color: #7E57C2;">lambda</span> <span style="color: #7E57C2;">(</span>arg<span style="color: #7E57C2;">)</span>
                      <span style="color: #7E57C2;">(</span>concat <span style="color: #5C6BC0;">(</span>url-hexify-string <span style="color: #0097A7;">(</span>car arg<span style="color: #0097A7;">)</span><span style="color: #5C6BC0;">)</span>
                              <span style="color: #66BB6A;">"="</span>
                              <span style="color: #5C6BC0;">(</span>url-hexify-string <span style="color: #0097A7;">(</span>cdr arg<span style="color: #0097A7;">)</span><span style="color: #5C6BC0;">)</span><span style="color: #7E57C2;">)</span><span style="color: #EC407A;">)</span>
                    args
                    <span style="color: #66BB6A;">"&amp;"</span><span style="color: #00897B;">)</span><span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span>
    <span style="color: #00B8D4;">(</span>switch-to-buffer
     <span style="color: #1E88E5;">(</span>url-retrieve-synchronously url<span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span>
    <span style="color: #00B8D4;">(</span>goto-char <span style="color: #1E88E5;">(</span>point-min<span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span>
    <span style="color: #00B8D4;">(</span>re-search-forward <span style="color: #66BB6A;">"\n\n"</span><span style="color: #00B8D4;">)</span>
    <span style="color: #00B8D4;">(</span><span style="color: #7E57C2;">setq</span> response-string
          <span style="color: #1E88E5;">(</span>buffer-substring-no-properties <span style="color: #00897B;">(</span>point<span style="color: #00897B;">)</span> <span style="color: #00897B;">(</span>point-max<span style="color: #00897B;">)</span><span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span>
    <span style="color: #00B8D4;">(</span>kill-buffer <span style="color: #1E88E5;">(</span>current-buffer<span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span>
    response-string<span style="color: #9FA8DA;">)</span>
  <span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">======================================================================</span>

<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">sql-query-format</span> <span style="color: #9FA8DA;">(</span>query<span style="color: #9FA8DA;">)</span>
  <span style="color: #78909C;">"We use sqlformat.org API to format QUERY given as parameter"</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">setq</span> answer
        <span style="color: #00B8D4;">(</span>url-http-post <span style="color: #66BB6A;">"https://sqlformat.org/api/v1/format"</span>
                       <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">Here the trick is to use the ` to force to parse the</span>
                       <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">,query parameter (note the , before!)</span>
                       `<span style="color: #1E88E5;">(</span><span style="color: #00897B;">(</span><span style="color: #66BB6A;">"sql"</span> . ,query<span style="color: #00897B;">)</span>
                         <span style="color: #00897B;">(</span><span style="color: #66BB6A;">"reindent"</span> . <span style="color: #66BB6A;">"1"</span><span style="color: #00897B;">)</span><span style="color: #1E88E5;">)</span>
                       <span style="color: #00B8D4;">)</span>
        <span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>cdr <span style="color: #00B8D4;">(</span>assoc 'result <span style="color: #1E88E5;">(</span>json-read-from-string answer<span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span><span style="color: #9FA8DA;">)</span>
<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">======================================================================</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">Testing our function with simple lisp</span>
<span style="color: #90A4AE;">;;</span><span style="color: #bebebe; font-style: italic;">(sql-query-format "select * from users where email='test@example.com'")</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">Getting a query from the buffer</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">ced/sql-query-format-paragraph</span> <span style="color: #9FA8DA;">()</span>
  <span style="color: #78909C;">"We take the current paragraph as a query and format it."</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">interactive</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">save-excursion</span>
    <span style="color: #00B8D4;">(</span><span style="color: #7E57C2;">progn</span>
      <span style="color: #1E88E5;">(</span>backward-paragraph<span style="color: #1E88E5;">)</span>
      <span style="color: #1E88E5;">(</span>set-mark <span style="color: #00897B;">(</span>point<span style="color: #00897B;">)</span><span style="color: #1E88E5;">)</span>
      <span style="color: #1E88E5;">(</span>forward-paragraph<span style="color: #1E88E5;">)</span>
      <span style="color: #1E88E5;">(</span><span style="color: #7E57C2;">setq</span> query <span style="color: #00897B;">(</span>buffer-substring-no-properties <span style="color: #EC407A;">(</span>mark<span style="color: #EC407A;">)</span> <span style="color: #EC407A;">(</span>point<span style="color: #EC407A;">)</span><span style="color: #00897B;">)</span><span style="color: #1E88E5;">)</span>
      <span style="color: #1E88E5;">(</span><span style="color: #7E57C2;">setq</span> query-formated <span style="color: #00897B;">(</span>sql-query-format query<span style="color: #00897B;">)</span><span style="color: #1E88E5;">)</span>
      <span style="color: #1E88E5;">(</span>kill-region <span style="color: #00897B;">(</span>mark<span style="color: #00897B;">)</span> <span style="color: #00897B;">(</span>point<span style="color: #00897B;">)</span><span style="color: #1E88E5;">)</span>
      <span style="color: #1E88E5;">(</span>insert query-formated<span style="color: #1E88E5;">)</span>
      <span style="color: #00B8D4;">)</span>
    <span style="color: #9FA8DA;">)</span>
  <span style="color: #B388FF;">)</span>
</pre>
</div>
</div>
</div>
