emacs/init.html

<div id="outline-container-org3df607f" class="outline-3">
<h3 id="org3df607f">HTML related</h3>
<div class="outline-text-3" id="text-org3df607f">
</div><div id="outline-container-org9ae4bd8" class="outline-4">
<h4 id="org9ae4bd8">Ruby tag</h4>
<div class="outline-text-4" id="text-org9ae4bd8">
<p>
Formats a string with ruby tag.
</p>

<pre class="example">
è»Š(ãã‚‹ã¾)

</pre>

<p>
will turn into
</p>

<pre class="example">
&lt;ruby&gt;è»Š&lt;rp&gt;(&lt;/rp&gt;&lt;rt&gt;ãã‚‹ã¾&lt;/rt&gt;&lt;rp&gt;)&lt;/rp&gt;&lt;/ruby&gt;

</pre>

<p>
<b>Note:</b> Point will be moved after <code>&lt;/ruby&gt;</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">ced/ruby-make-rp</span> <span style="color: #9FA8DA;">()</span>
  <span style="color: #78909C;">"Point has to be after the character to wrap."</span>
  <span style="color: #9FA8DA;">(</span>backward-char<span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>insert <span style="color: #66BB6A;">"&lt;rp&gt;"</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>forward-char<span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>insert <span style="color: #66BB6A;">"&lt;/rp&gt;"</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #B388FF;">)</span>

<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">ced/ruby-make</span> <span style="color: #9FA8DA;">()</span>
  <span style="color: #78909C;">"Point has to be on the first character to be included in the ruby tag.</span>
<span style="color: #78909C;">ie: &#36554;(&#12367;&#12427;&#12414;) -&gt; &lt;ruby&gt;&#36554;&lt;rp&gt;(&lt;/rp&gt;&lt;rt&gt;&#12367;&#12427;&#12414;&lt;/rt&gt;&lt;rp&gt;)&lt;/rp&gt;&lt;/ruby&gt;</span>
<span style="color: #78909C;">Point will be moved after the closing ruby tag."</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">interactive</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">save-excursion</span>
    <span style="color: #00B8D4;">(</span>insert <span style="color: #66BB6A;">"&lt;ruby&gt;"</span><span style="color: #00B8D4;">)</span>

    <span style="color: #00B8D4;">(</span>search-forward <span style="color: #66BB6A;">"("</span><span style="color: #00B8D4;">)</span>
    <span style="color: #00B8D4;">(</span>ced/ruby-make-rp<span style="color: #00B8D4;">)</span>

    <span style="color: #00B8D4;">(</span>insert <span style="color: #66BB6A;">"&lt;rt&gt;"</span><span style="color: #00B8D4;">)</span>
    <span style="color: #00B8D4;">(</span>search-forward <span style="color: #66BB6A;">")"</span><span style="color: #00B8D4;">)</span>
    <span style="color: #00B8D4;">(</span>backward-char<span style="color: #00B8D4;">)</span>
    <span style="color: #00B8D4;">(</span>insert <span style="color: #66BB6A;">"&lt;/rt&gt;"</span><span style="color: #00B8D4;">)</span>

    <span style="color: #00B8D4;">(</span>forward-char<span style="color: #00B8D4;">)</span>
    <span style="color: #00B8D4;">(</span>ced/ruby-make-rp<span style="color: #00B8D4;">)</span>
    <span style="color: #00B8D4;">(</span>insert <span style="color: #66BB6A;">"&lt;/ruby&gt;"</span><span style="color: #00B8D4;">)</span>
    <span style="color: #9FA8DA;">)</span>
  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">move point after the closing ruby tag</span>
  <span style="color: #9FA8DA;">(</span>search-forward <span style="color: #66BB6A;">"&lt;/ruby&gt;"</span><span style="color: #9FA8DA;">)</span>
<span style="color: #B388FF;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org2adf478" class="outline-3">
<h3 id="org2adf478"><span class="todo TODO">TODO</span> Misc&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cleanup">cleanup</span>&#xa0;<span class="split">split</span></span></h3>
<div class="outline-text-3" id="text-org2adf478">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">ced/create-tags</span> <span style="color: #9FA8DA;">(</span>dir-name<span style="color: #9FA8DA;">)</span>
  <span style="color: #78909C;">"Create tags file."</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">interactive</span> <span style="color: #66BB6A;">"DDirectory: "</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">let</span> <span style="color: #00B8D4;">(</span><span style="color: #1E88E5;">(</span>full-command <span style="color: #00897B;">(</span>format <span style="color: #66BB6A;">"%s -R -e --exclude=.svn --exclude=node_modules --exclude=_test --exclude=smarty --exclude=\"*.min.*\" --langmap=php:.php.inc --PHP-kinds=+cf-v %s"</span> myctags-command <span style="color: #EC407A;">(</span>directory-file-name dir-name<span style="color: #EC407A;">)</span><span style="color: #00897B;">)</span><span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span>
    <span style="color: #00B8D4;">(</span>message <span style="color: #1E88E5;">(</span>format <span style="color: #66BB6A;">"Full ctags command: %s"</span> full-command<span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span>
    <span style="color: #00B8D4;">(</span>cd <span style="color: #1E88E5;">(</span>directory-file-name dir-name<span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span>
    <span style="color: #00B8D4;">(</span>shell-command full-command<span style="color: #00B8D4;">)</span>
    <span style="color: #9FA8DA;">)</span>
  <span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">programming related ===</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">commenting a line</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">ced/comment-line</span> <span style="color: #9FA8DA;">()</span>
  <span style="color: #78909C;">"We comment or uncomment an existing line."</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">interactive</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">save-excursion</span>
    <span style="color: #00B8D4;">(</span>comment-or-uncomment-region <span style="color: #1E88E5;">(</span>point-at-bol<span style="color: #1E88E5;">)</span> <span style="color: #1E88E5;">(</span>point-at-eol<span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span>
    <span style="color: #9FA8DA;">)</span>
  <span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">utilities</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">ced/duplicate-line</span> <span style="color: #9FA8DA;">()</span>
  <span style="color: #78909C;">"Duplicates the current line and insert it bellow."</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">interactive</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">let</span> <span style="color: #00B8D4;">(</span><span style="color: #1E88E5;">(</span>line <span style="color: #00897B;">(</span>buffer-substring <span style="color: #EC407A;">(</span>point-at-bol<span style="color: #EC407A;">)</span> <span style="color: #EC407A;">(</span>point-at-eol<span style="color: #EC407A;">)</span><span style="color: #00897B;">)</span><span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span>
    <span style="color: #00B8D4;">(</span>end-of-line<span style="color: #00B8D4;">)</span>
    <span style="color: #00B8D4;">(</span>newline<span style="color: #00B8D4;">)</span>
    <span style="color: #00B8D4;">(</span>insert line<span style="color: #00B8D4;">)</span>
    <span style="color: #00B8D4;">(</span>beginning-of-line<span style="color: #00B8D4;">)</span>
    <span style="color: #9FA8DA;">)</span>
  <span style="color: #B388FF;">)</span>

<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">ced/join-lines</span> <span style="color: #9FA8DA;">()</span>
  <span style="color: #78909C;">"Joining lines like in VIM"</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">interactive</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>next-line<span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>join-line<span style="color: #9FA8DA;">)</span>
  <span style="color: #B388FF;">)</span>


<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">ced/decrement-number-at-point</span> <span style="color: #9FA8DA;">()</span>
  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">Increment number at point</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">interactive</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>skip-chars-backward <span style="color: #66BB6A;">"0123456789"</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">or</span> <span style="color: #00B8D4;">(</span>looking-at <span style="color: #66BB6A;">"[0123456789]+"</span><span style="color: #00B8D4;">)</span>
      <span style="color: #00B8D4;">(</span><span style="color: #D50000;">error</span> <span style="color: #66BB6A;">"No number at point"</span><span style="color: #00B8D4;">)</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>replace-match <span style="color: #00B8D4;">(</span>number-to-string <span style="color: #1E88E5;">(</span>1- <span style="color: #00897B;">(</span>string-to-number <span style="color: #EC407A;">(</span>match-string 0<span style="color: #EC407A;">)</span><span style="color: #00897B;">)</span><span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span><span style="color: #9FA8DA;">)</span><span style="color: #B388FF;">)</span>


<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">ced/increment-number-at-point</span> <span style="color: #9FA8DA;">()</span>
  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">decrement number at point</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">interactive</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>skip-chars-backward <span style="color: #66BB6A;">"0123456789"</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">or</span> <span style="color: #00B8D4;">(</span>looking-at <span style="color: #66BB6A;">"[0123456789]+"</span><span style="color: #00B8D4;">)</span>
      <span style="color: #00B8D4;">(</span><span style="color: #D50000;">error</span> <span style="color: #66BB6A;">"No number at point"</span><span style="color: #00B8D4;">)</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>replace-match <span style="color: #00B8D4;">(</span>number-to-string <span style="color: #1E88E5;">(</span>1+ <span style="color: #00897B;">(</span>string-to-number <span style="color: #EC407A;">(</span>match-string 0<span style="color: #EC407A;">)</span><span style="color: #00897B;">)</span><span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span><span style="color: #9FA8DA;">)</span><span style="color: #B388FF;">)</span>


<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">Date insertion</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">ced/insert-current-date-ymd</span> <span style="color: #9FA8DA;">()</span>
  <span style="color: #78909C;">"&#29694;&#22312;&#12398;&#24180;&#26376;&#26085;&#26332;&#12434;&#12371;&#12398;&#38918;&#12395;&#12459;&#12540;&#12477;&#12523;&#20301;&#32622;&#12395;&#25407;&#20837;&#12377;&#12427;&#12290;&#20363;&#65306;2001-07-23"</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">interactive</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">let</span> <span style="color: #00B8D4;">(</span>pt <span style="color: #1E88E5;">(</span>today <span style="color: #00897B;">(</span>format-time-string <span style="color: #66BB6A;">"%Y-%m-%d"</span> nil<span style="color: #00897B;">)</span><span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span>

    <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">We check it we are on a blank character</span>
    <span style="color: #00B8D4;">(</span><span style="color: #7E57C2;">if</span> <span style="color: #1E88E5;">(</span><span style="color: #7E57C2;">or</span>
         <span style="color: #00897B;">(</span>char-equal ?\s  <span style="color: #EC407A;">(</span>char-after<span style="color: #EC407A;">)</span><span style="color: #00897B;">)</span>
         <span style="color: #00897B;">(</span>char-equal ?\n <span style="color: #EC407A;">(</span>char-after<span style="color: #EC407A;">)</span><span style="color: #00897B;">)</span>
         <span style="color: #00897B;">(</span>char-equal ?\t <span style="color: #EC407A;">(</span>char-after<span style="color: #EC407A;">)</span><span style="color: #00897B;">)</span>
         <span style="color: #1E88E5;">)</span>
        <span style="color: #1E88E5;">(</span>insert today<span style="color: #1E88E5;">)</span>
      <span style="color: #1E88E5;">(</span><span style="color: #7E57C2;">progn</span>
        <span style="color: #00897B;">(</span>skip-chars-backward <span style="color: #66BB6A;">"-0-9"</span><span style="color: #00897B;">)</span>
        <span style="color: #00897B;">(</span><span style="color: #7E57C2;">setq</span> pt <span style="color: #EC407A;">(</span>point<span style="color: #EC407A;">)</span><span style="color: #00897B;">)</span>
        <span style="color: #00897B;">(</span>skip-chars-forward <span style="color: #66BB6A;">"-0-9"</span><span style="color: #00897B;">)</span>

        <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">Before replacing the text, we need to be sure it's a date</span>
        <span style="color: #00897B;">(</span><span style="color: #7E57C2;">if</span> <span style="color: #EC407A;">(</span>string-match <span style="color: #66BB6A;">"[0-9]\\{4\\}-[0-9]\\{2\\}-[0-9]\\{2\\}"</span> <span style="color: #7E57C2;">(</span>buffer-substring-no-properties pt <span style="color: #5C6BC0;">(</span>point<span style="color: #5C6BC0;">)</span><span style="color: #7E57C2;">)</span><span style="color: #EC407A;">)</span>
            <span style="color: #EC407A;">(</span><span style="color: #7E57C2;">progn</span>
              <span style="color: #7E57C2;">(</span>delete-region pt <span style="color: #5C6BC0;">(</span>point<span style="color: #5C6BC0;">)</span><span style="color: #7E57C2;">)</span>
              <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">replacing selection with current date</span>
              <span style="color: #7E57C2;">(</span>insert today<span style="color: #7E57C2;">)</span>
              <span style="color: #EC407A;">)</span>
          <span style="color: #00897B;">)</span>
        <span style="color: #1E88E5;">)</span>
      <span style="color: #00B8D4;">)</span>
    <span style="color: #9FA8DA;">)</span>
  <span style="color: #B388FF;">)</span> 

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">======================================================================</span>

<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">ced/do-highlight</span> <span style="color: #9FA8DA;">(</span>text<span style="color: #9FA8DA;">)</span>
  <span style="color: #78909C;">"We simply highlight TEXT"</span>
  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">(unhighlight-regexp 'last-text)        ; clear highlight</span>
  <span style="color: #9FA8DA;">(</span>pop-mark<span style="color: #9FA8DA;">)</span>                    <span style="color: #90A4AE;">; </span><span style="color: #bebebe; font-style: italic;">clears the region</span>
  <span style="color: #9FA8DA;">(</span>highlight-regexp text<span style="color: #9FA8DA;">)</span>       <span style="color: #90A4AE;">; </span><span style="color: #bebebe; font-style: italic;">new text to highlight</span>
  <span style="color: #B388FF;">)</span>


<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">ced/do-search</span> <span style="color: #9FA8DA;">(</span>text<span style="color: #9FA8DA;">)</span>
  <span style="color: #78909C;">"We do the search of TEXT"</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">unless</span> <span style="color: #00B8D4;">(</span>search-forward text nil t<span style="color: #00B8D4;">)</span>
    <span style="color: #00B8D4;">(</span>message <span style="color: #66BB6A;">"Nothing to find!"</span><span style="color: #00B8D4;">)</span>
    <span style="color: #9FA8DA;">)</span>
  <span style="color: #B388FF;">)</span>


<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">ced/search-region</span> <span style="color: #9FA8DA;">(</span>point mark <span style="color: #D84315;">&amp;optional</span> arg<span style="color: #9FA8DA;">)</span>
  <span style="color: #78909C;">"If we have a region, we highlight the text in that region.</span>
<span style="color: #78909C;">If no region but a previous search, we jump and highlight to the next occurance.</span>
<span style="color: #78909C;">If we have a prefix (C-u), we clear the highlight.</span>
<span style="color: #78909C;">"</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">interactive</span> <span style="color: #66BB6A;">"r\nP"</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>make-variable-buffer-local 'last-text<span style="color: #9FA8DA;">)</span>

  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">(message (format "prefix %s" arg))</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">if</span> <span style="color: #00B8D4;">(</span>equal arg '<span style="color: #1E88E5;">(</span>4<span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span>  <span style="color: #90A4AE;">; </span><span style="color: #bebebe; font-style: italic;">C-u</span>
      <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">We do not search if if have prefix argument</span>
      <span style="color: #00B8D4;">(</span>unhighlight-regexp last-text<span style="color: #00B8D4;">)</span>

    <span style="color: #00B8D4;">(</span><span style="color: #7E57C2;">if</span> <span style="color: #1E88E5;">(</span>use-region-p<span style="color: #1E88E5;">)</span> 
        <span style="color: #1E88E5;">(</span><span style="color: #7E57C2;">let</span> <span style="color: #00897B;">(</span><span style="color: #EC407A;">(</span>point-bkp point<span style="color: #EC407A;">)</span> <span style="color: #EC407A;">(</span>text <span style="color: #7E57C2;">(</span>buffer-substring-no-properties point mark<span style="color: #7E57C2;">)</span><span style="color: #EC407A;">)</span><span style="color: #00897B;">)</span>
          <span style="color: #00897B;">(</span><span style="color: #7E57C2;">setq</span> last-text text<span style="color: #00897B;">)</span>         <span style="color: #90A4AE;">;</span><span style="color: #bebebe; font-style: italic;">saving for later</span>
          <span style="color: #00897B;">(</span>ced/do-highlight text<span style="color: #00897B;">)</span>
          <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">if we come to cancel the action somehow,</span>
          <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">we have a point backup available</span>
          <span style="color: #1E88E5;">)</span>

      <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">We use the previous search if any</span>
      <span style="color: #1E88E5;">(</span><span style="color: #7E57C2;">when</span> last-text
        <span style="color: #00897B;">(</span>ced/do-search last-text<span style="color: #00897B;">)</span>
        <span style="color: #1E88E5;">)</span>
      <span style="color: #00B8D4;">)</span>        
    <span style="color: #9FA8DA;">)</span>
  <span style="color: #B388FF;">)</span>


<span style="color: #90A4AE;">;;; </span><span style="color: #bebebe; font-style: italic;">Translate JP to EN with google translate opened in browser</span>
<span style="color: #90A4AE;">;;; </span><span style="color: #bebebe; font-style: italic;">The available google-translate module doesn't give the reading, which I want</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">&#26085;&#26412;&#35486;&#12391;&#12377;</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">ced/google-translate-jp-en</span> <span style="color: #9FA8DA;">(</span>from_ to_<span style="color: #9FA8DA;">)</span>
  <span style="color: #78909C;">"Takes current selection and opens the tranlation of google in the browser"</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">interactive</span> <span style="color: #66BB6A;">"r"</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">save-excursion</span> 
    <span style="color: #00B8D4;">(</span><span style="color: #7E57C2;">if</span> <span style="color: #1E88E5;">(</span>use-region-p<span style="color: #1E88E5;">)</span>
        <span style="color: #1E88E5;">(</span><span style="color: #7E57C2;">let</span> <span style="color: #00897B;">(</span><span style="color: #EC407A;">(</span>text <span style="color: #7E57C2;">(</span>buffer-substring-no-properties from_ to_<span style="color: #7E57C2;">)</span><span style="color: #EC407A;">)</span><span style="color: #00897B;">)</span>                    
          <span style="color: #00897B;">(</span>browse-url <span style="color: #EC407A;">(</span>concat <span style="color: #66BB6A;">"https://translate.google.com/#ja/en/"</span> text<span style="color: #EC407A;">)</span><span style="color: #00897B;">)</span>
          <span style="color: #1E88E5;">)</span>
      <span style="color: #1E88E5;">(</span>message <span style="color: #66BB6A;">"Please use a region."</span><span style="color: #1E88E5;">)</span>
      <span style="color: #00B8D4;">)</span>
    <span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>deactivate-mark<span style="color: #9FA8DA;">)</span>                 <span style="color: #90A4AE;">; </span><span style="color: #bebebe; font-style: italic;">clear region</span>
  <span style="color: #B388FF;">)</span>


<span style="color: #90A4AE;">;;; </span><span style="color: #bebebe; font-style: italic;">inspired from http://stackoverflow.com/a/34434144/921796</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">ced/file-read-contents</span> <span style="color: #9FA8DA;">(</span>filename<span style="color: #9FA8DA;">)</span>
  <span style="color: #78909C;">"Return the contents of FILENAME."</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">with-temp-buffer</span>
    <span style="color: #00B8D4;">(</span>insert-file-contents filename<span style="color: #00B8D4;">)</span>
    <span style="color: #00B8D4;">(</span>buffer-string<span style="color: #00B8D4;">)</span><span style="color: #9FA8DA;">)</span><span style="color: #B388FF;">)</span>


<span style="color: #90A4AE;">;;; </span><span style="color: #bebebe; font-style: italic;">Window split change</span>
<span style="color: #90A4AE;">;;; </span><span style="color: #bebebe; font-style: italic;">===================</span>
<span style="color: #90A4AE;">;;; </span><span style="color: #bebebe; font-style: italic;">found at: http://stackoverflow.com/a/33456622/921796</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">toggle-window-split</span> <span style="color: #9FA8DA;">()</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">interactive</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">if</span> <span style="color: #00B8D4;">(</span>= <span style="color: #1E88E5;">(</span>count-windows<span style="color: #1E88E5;">)</span> 2<span style="color: #00B8D4;">)</span>
      <span style="color: #00B8D4;">(</span><span style="color: #7E57C2;">let*</span> <span style="color: #1E88E5;">(</span><span style="color: #00897B;">(</span>this-win-buffer <span style="color: #EC407A;">(</span>window-buffer<span style="color: #EC407A;">)</span><span style="color: #00897B;">)</span>
         <span style="color: #00897B;">(</span>next-win-buffer <span style="color: #EC407A;">(</span>window-buffer <span style="color: #7E57C2;">(</span>next-window<span style="color: #7E57C2;">)</span><span style="color: #EC407A;">)</span><span style="color: #00897B;">)</span>
         <span style="color: #00897B;">(</span>this-win-edges <span style="color: #EC407A;">(</span>window-edges <span style="color: #7E57C2;">(</span>selected-window<span style="color: #7E57C2;">)</span><span style="color: #EC407A;">)</span><span style="color: #00897B;">)</span>
         <span style="color: #00897B;">(</span>next-win-edges <span style="color: #EC407A;">(</span>window-edges <span style="color: #7E57C2;">(</span>next-window<span style="color: #7E57C2;">)</span><span style="color: #EC407A;">)</span><span style="color: #00897B;">)</span>
         <span style="color: #00897B;">(</span>this-win-2nd <span style="color: #EC407A;">(</span>not <span style="color: #7E57C2;">(</span><span style="color: #7E57C2;">and</span> <span style="color: #5C6BC0;">(</span>&lt;= <span style="color: #0097A7;">(</span>car this-win-edges<span style="color: #0097A7;">)</span>
                     <span style="color: #0097A7;">(</span>car next-win-edges<span style="color: #0097A7;">)</span><span style="color: #5C6BC0;">)</span>
                     <span style="color: #5C6BC0;">(</span>&lt;= <span style="color: #0097A7;">(</span>cadr this-win-edges<span style="color: #0097A7;">)</span>
                     <span style="color: #0097A7;">(</span>cadr next-win-edges<span style="color: #0097A7;">)</span><span style="color: #5C6BC0;">)</span><span style="color: #7E57C2;">)</span><span style="color: #EC407A;">)</span><span style="color: #00897B;">)</span>
         <span style="color: #00897B;">(</span>splitter
          <span style="color: #EC407A;">(</span><span style="color: #7E57C2;">if</span> <span style="color: #7E57C2;">(</span>= <span style="color: #5C6BC0;">(</span>car this-win-edges<span style="color: #5C6BC0;">)</span>
             <span style="color: #5C6BC0;">(</span>car <span style="color: #0097A7;">(</span>window-edges <span style="color: #B388FF;">(</span>next-window<span style="color: #B388FF;">)</span><span style="color: #0097A7;">)</span><span style="color: #5C6BC0;">)</span><span style="color: #7E57C2;">)</span>
          'split-window-horizontally
        'split-window-vertically<span style="color: #EC407A;">)</span><span style="color: #00897B;">)</span><span style="color: #1E88E5;">)</span>
    <span style="color: #1E88E5;">(</span>delete-other-windows<span style="color: #1E88E5;">)</span>
    <span style="color: #1E88E5;">(</span><span style="color: #7E57C2;">let</span> <span style="color: #00897B;">(</span><span style="color: #EC407A;">(</span>first-win <span style="color: #7E57C2;">(</span>selected-window<span style="color: #7E57C2;">)</span><span style="color: #EC407A;">)</span><span style="color: #00897B;">)</span>
      <span style="color: #00897B;">(</span>funcall splitter<span style="color: #00897B;">)</span>
      <span style="color: #00897B;">(</span><span style="color: #7E57C2;">if</span> this-win-2nd <span style="color: #EC407A;">(</span>other-window 1<span style="color: #EC407A;">)</span><span style="color: #00897B;">)</span>
      <span style="color: #00897B;">(</span>set-window-buffer <span style="color: #EC407A;">(</span>selected-window<span style="color: #EC407A;">)</span> this-win-buffer<span style="color: #00897B;">)</span>
      <span style="color: #00897B;">(</span>set-window-buffer <span style="color: #EC407A;">(</span>next-window<span style="color: #EC407A;">)</span> next-win-buffer<span style="color: #00897B;">)</span>
      <span style="color: #00897B;">(</span>select-window first-win<span style="color: #00897B;">)</span>
      <span style="color: #00897B;">(</span><span style="color: #7E57C2;">if</span> this-win-2nd <span style="color: #EC407A;">(</span>other-window 1<span style="color: #EC407A;">)</span><span style="color: #00897B;">)</span><span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span><span style="color: #9FA8DA;">)</span><span style="color: #B388FF;">)</span>

</pre>
</div>
</div>
</div>
