emacs/init.org
** Text decoding
*** Base64 -> utf-8
#+BEGIN_SRC emacs-lisp
(defun ced/decode-base64-utf8 (start end)
  "Decodes an utf-8 email file content encoded in base 64.
Region needed"
  (interactive "r")
  (save-excursion
     (narrow-to-region start end) ; needed because the the base64 decoded region has different boudaries
     (base64-decode-region start end)
     (decode-coding-region (point-min) (point-max) 'utf-8)
     (widen) ; needed to restore the view to full buffer
	)
)
#+END_SRC

* INIT
** Global settings
#+BEGIN_SRC emacs-lisp
;; Language + Encoding
(set-language-environment "UTF-8")

;; No need of startup screen
(setq inhibit-startup-screen t)

;; default answers with y/n
(defalias 'yes-or-no-p 'y-or-n-p)

;; White space customization
;; source : http://ergoemacs.org/emacs/whitespace-mode.html
(setq whitespace-display-mappings
      ;; all numbers are Unicode codepoint in decimal. try (insert-char 182 ) to see it
      '(
	(space-mark 32 [183] [46]) ; 32 SPACE, 183 MIDDLE DOT 「·」, 46 FULL STOP 「.」
	(newline-mark 10 [182 10]) ; 10 LINE FEED
	(tab-mark 9 [9655 9] [92 9]) ; 9 TAB, 9655 WHITE RIGHT-POINTING TRIANGLE 「▷」
	))

;; better scrolling
;; found here: https://ogbe.net/emacsconfig.html
(setq scroll-step            1
      scroll-conservatively  10000)

;; scroll margin
(setq scroll-margin 3)
#+END_SRC

** Status Bar related
#+BEGIN_SRC
;; (nyan-mode)
;; (setq nyan-bar-length 10)

;; Powerline
;; (require 'powerline)
;; (powerline-default-theme)
;; (powerline-reset)
#+END_SRC

** Search + Selection related
#+BEGIN_SRC emacs-lisp
;; replace hidden text as well
;(setq search-invisible t)
;; the default is 'open and it opens the hidden content if needed

;; copy selection when done with the mouse
(setq mouse-drag-copy-region t)
#+END_SRC

** Display related
#+BEGIN_SRC emacs-lisp
;; supposed to help with my font problems (symbola font required)
;(set-fontset-font "fontset-default" '(#x25A0 . #x265F)  '("Symbola" . "iso10646-1") nil 'prepend)

;; Maximum buffer highlighting!
(defconst font-lock-maximum-decoration t)

;; No Scroll bars
(scroll-bar-mode -1)

;; No tool bar
;(menu-bar-mode 0)
(tool-bar-mode 0)

;; matching parens
(show-paren-mode 1)

;; Use visual-line-mode for line wrapping
(setq visual-line-fringe-indicators '(left-curly-arrow right-curly-arrow))
(global-visual-line-mode 1)
(global-hl-line-mode 0)

;; showing empty lines at end of buffer
(toggle-indicate-empty-lines 1)

;; indentation
(electric-indent-mode 1)
#+END_SRC

** Git related
#+BEGIN_SRC emacs-lisp
(global-git-gutter-mode 1)
#+END_SRC

** Grep related
#+BEGIN_SRC emacs-lisp
;; might be only for windows, we'll see at next reboot on another system
(setq grep-use-null-device nil)
(setq grep-command "grep -nHr --color=always . ")
#+END_SRC
** Files and Buffers related
#+BEGIN_SRC emacs-lisp
;; ido (matcher for commands/buffers and more)
(require 'ido)
(ido-mode 1)
(setq ido-enable-flex-matching 1)
(setq ido-auto-merge-work-directories-length -1)
#+END_SRC

** Default scratch buffer
#+BEGIN_SRC emacs-lisp
(setq initial-major-mode 'org-mode)
(setq initial-scratch-message "\
# C'est mon buffer org par default.
# Il n'est pas sauvegarde! Faire attention ;)
")
#+END_SRC

