emacs/init.html
<div id="outline-container-org7d5376c" class="outline-3">
<h3 id="org7d5376c">Text decoding</h3>
<div class="outline-text-3" id="text-org7d5376c">
</div><div id="outline-container-orgb617f55" class="outline-4">
<h4 id="orgb617f55">Base64 -&gt; utf-8</h4>
<div class="outline-text-4" id="text-orgb617f55">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">ced/decode-base64-utf8</span> <span style="color: #9FA8DA;">(</span>start end<span style="color: #9FA8DA;">)</span>
  <span style="color: #78909C;">"Decodes an utf-8 email file content encoded in base 64.</span>
<span style="color: #78909C;">Region needed"</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">interactive</span> <span style="color: #66BB6A;">"r"</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">save-excursion</span>
     <span style="color: #00B8D4;">(</span>narrow-to-region start end<span style="color: #00B8D4;">)</span> <span style="color: #90A4AE;">; </span><span style="color: #bebebe; font-style: italic;">needed because the the base64 decoded region has different boudaries</span>
     <span style="color: #00B8D4;">(</span>base64-decode-region start end<span style="color: #00B8D4;">)</span>
     <span style="color: #00B8D4;">(</span>decode-coding-region <span style="color: #1E88E5;">(</span>point-min<span style="color: #1E88E5;">)</span> <span style="color: #1E88E5;">(</span>point-max<span style="color: #1E88E5;">)</span> 'utf-8<span style="color: #00B8D4;">)</span>
     <span style="color: #00B8D4;">(</span>widen<span style="color: #00B8D4;">)</span> <span style="color: #90A4AE;">; </span><span style="color: #bebebe; font-style: italic;">needed to restore the view to full buffer</span>
    <span style="color: #9FA8DA;">)</span>
<span style="color: #B388FF;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org97ec8be" class="outline-2">
<h2 id="org97ec8be">INIT</h2>
<div class="outline-text-2" id="text-org97ec8be">
</div><div id="outline-container-org1b0ea05" class="outline-3">
<h3 id="org1b0ea05">Global settings</h3>
<div class="outline-text-3" id="text-org1b0ea05">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">Language + Encoding</span>
<span style="color: #B388FF;">(</span>set-language-environment <span style="color: #66BB6A;">"UTF-8"</span><span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">No need of startup screen</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> inhibit-startup-screen t<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">default answers with y/n</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defalias</span> '<span style="color: #42A5F5;">yes-or-no-p</span> 'y-or-n-p<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">White space customization</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">source : http://ergoemacs.org/emacs/whitespace-mode.html</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> whitespace-display-mappings
      <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">all numbers are Unicode codepoint in decimal. try (insert-char 182 ) to see it</span>
      '<span style="color: #9FA8DA;">(</span>
    <span style="color: #00B8D4;">(</span>space-mark 32 <span style="color: #1E88E5;">[</span>183<span style="color: #1E88E5;">]</span> <span style="color: #1E88E5;">[</span>46<span style="color: #1E88E5;">]</span><span style="color: #00B8D4;">)</span> <span style="color: #90A4AE;">; </span><span style="color: #bebebe; font-style: italic;">32 SPACE, 183 MIDDLE DOT &#12300;&#183;&#12301;, 46 FULL STOP &#12300;.&#12301;</span>
    <span style="color: #00B8D4;">(</span>newline-mark 10 <span style="color: #1E88E5;">[</span>182 10<span style="color: #1E88E5;">]</span><span style="color: #00B8D4;">)</span> <span style="color: #90A4AE;">; </span><span style="color: #bebebe; font-style: italic;">10 LINE FEED</span>
    <span style="color: #00B8D4;">(</span>tab-mark 9 <span style="color: #1E88E5;">[</span>9655 9<span style="color: #1E88E5;">]</span> <span style="color: #1E88E5;">[</span>92 9<span style="color: #1E88E5;">]</span><span style="color: #00B8D4;">)</span> <span style="color: #90A4AE;">; </span><span style="color: #bebebe; font-style: italic;">9 TAB, 9655 WHITE RIGHT-POINTING TRIANGLE &#12300;&#9655;&#12301;</span>
    <span style="color: #9FA8DA;">)</span><span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">better scrolling</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">found here: https://ogbe.net/emacsconfig.html</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> scroll-step            1
      scroll-conservatively  10000<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">scroll margin</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> scroll-margin 3<span style="color: #B388FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org791df97" class="outline-3">
<h3 id="org791df97">Status Bar related</h3>
<div class="outline-text-3" id="text-org791df97">
<pre class="example">
;; (nyan-mode)
;; (setq nyan-bar-length 10)

;; Powerline
;; (require 'powerline)
;; (powerline-default-theme)
;; (powerline-reset)
</pre>
</div>
</div>

<div id="outline-container-org1b202a8" class="outline-3">
<h3 id="org1b202a8">Search + Selection related</h3>
<div class="outline-text-3" id="text-org1b202a8">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">replace hidden text as well</span>
<span style="color: #90A4AE;">;</span><span style="color: #bebebe; font-style: italic;">(setq search-invisible t)</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">the default is 'open and it opens the hidden content if needed</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">copy selection when done with the mouse</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> mouse-drag-copy-region t<span style="color: #B388FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7f4c90e" class="outline-3">
<h3 id="org7f4c90e">Display related</h3>
<div class="outline-text-3" id="text-org7f4c90e">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">supposed to help with my font problems (symbola font required)</span>
<span style="color: #90A4AE;">;</span><span style="color: #bebebe; font-style: italic;">(set-fontset-font "fontset-default" '(#x25A0 . #x265F)  '("Symbola" . "iso10646-1") nil 'prepend)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">Maximum buffer highlighting!</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defconst</span> <span style="color: #26A69A;">font-lock-maximum-decoration</span> t<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">No Scroll bars</span>
<span style="color: #B388FF;">(</span>scroll-bar-mode -1<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">No tool bar</span>
<span style="color: #90A4AE;">;</span><span style="color: #bebebe; font-style: italic;">(menu-bar-mode 0)</span>
<span style="color: #B388FF;">(</span>tool-bar-mode 0<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">matching parens</span>
<span style="color: #B388FF;">(</span>show-paren-mode 1<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">Use visual-line-mode for line wrapping</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> visual-line-fringe-indicators '<span style="color: #9FA8DA;">(</span>left-curly-arrow right-curly-arrow<span style="color: #9FA8DA;">)</span><span style="color: #B388FF;">)</span>
<span style="color: #B388FF;">(</span>global-visual-line-mode 1<span style="color: #B388FF;">)</span>
<span style="color: #B388FF;">(</span>global-hl-line-mode 0<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">showing empty lines at end of buffer</span>
<span style="color: #B388FF;">(</span>toggle-indicate-empty-lines 1<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">indentation</span>
<span style="color: #B388FF;">(</span>electric-indent-mode 1<span style="color: #B388FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeb547b9" class="outline-3">
<h3 id="orgeb547b9">Git related</h3>
<div class="outline-text-3" id="text-orgeb547b9">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #B388FF;">(</span>global-git-gutter-mode 1<span style="color: #B388FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcde710e" class="outline-3">
<h3 id="orgcde710e">Grep related</h3>
<div class="outline-text-3" id="text-orgcde710e">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">might be only for windows, we'll see at next reboot on another system</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> grep-use-null-device nil<span style="color: #B388FF;">)</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> grep-command <span style="color: #66BB6A;">"grep -nHr --color=always . "</span><span style="color: #B388FF;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org6f3332a" class="outline-3">
<h3 id="org6f3332a">Files and Buffers related</h3>
<div class="outline-text-3" id="text-org6f3332a">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">ido (matcher for commands/buffers and more)</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">require</span> '<span style="color: #5C6BC0;">ido</span><span style="color: #B388FF;">)</span>
<span style="color: #B388FF;">(</span>ido-mode 1<span style="color: #B388FF;">)</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> ido-enable-flex-matching 1<span style="color: #B388FF;">)</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> ido-auto-merge-work-directories-length -1<span style="color: #B388FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7305363" class="outline-3">
<h3 id="org7305363">Default scratch buffer</h3>
<div class="outline-text-3" id="text-org7305363">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">(setq initial-major-mode 'org-mode)</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> initial-scratch-message <span style="color: #66BB6A;">"\</span>
<span style="color: #66BB6A;">;;; C'est mon buffer e-lisp par default.</span>
<span style="color: #66BB6A;">;;; Il n'est pas sauvegarde! Faire attention ;)</span>
<span style="color: #66BB6A;">"</span><span style="color: #B388FF;">)</span>
</pre>
</div>
</div>
</div>
