emacs/init.html

<div id="outline-container-orge98449d" class="outline-3">
<h3 id="orge98449d">Shortcuts</h3>
<div class="outline-text-3" id="text-orge98449d">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">Moving from window to window</span>
<span style="color: #B388FF;">(</span>global-set-key <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"C-c &lt;left&gt;"</span><span style="color: #9FA8DA;">)</span>  'windmove-left<span style="color: #B388FF;">)</span>
<span style="color: #B388FF;">(</span>global-set-key <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"C-c &lt;right&gt;"</span><span style="color: #9FA8DA;">)</span> 'windmove-right<span style="color: #B388FF;">)</span>
<span style="color: #B388FF;">(</span>global-set-key <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"C-c &lt;up&gt;"</span><span style="color: #9FA8DA;">)</span>    'windmove-up<span style="color: #B388FF;">)</span>
<span style="color: #B388FF;">(</span>global-set-key <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"C-c &lt;down&gt;"</span><span style="color: #9FA8DA;">)</span>  'windmove-down<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">A little like in Vim, I don't use those that othen.</span>
<span style="color: #B388FF;">(</span>global-set-key <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"C-c C-;"</span><span style="color: #9FA8DA;">)</span> 'goto-last-change<span style="color: #B388FF;">)</span>
<span style="color: #B388FF;">(</span>global-set-key <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"C-c C-,"</span><span style="color: #9FA8DA;">)</span> 'goto-last-change-reverse<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">my custom search sticky highlight</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> lazy-highlight-cleanup 1<span style="color: #B388FF;">)</span>         <span style="color: #90A4AE;">; </span><span style="color: #bebebe; font-style: italic;">nil to leave lazy search highlight</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> lazy-highlight-initial-delay 0<span style="color: #B388FF;">)</span>   <span style="color: #90A4AE;">; </span><span style="color: #bebebe; font-style: italic;">highlight search right away</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">+ cleanup binding</span>
<span style="color: #B388FF;">(</span>global-set-key <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"C-c &lt;SPC&gt;"</span><span style="color: #9FA8DA;">)</span> 'lazy-highlight-cleanup<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">search tool: swiper (convinient but slow in large files)</span>
<span style="color: #B388FF;">(</span>global-set-key <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"C-S-s"</span><span style="color: #9FA8DA;">)</span> 'swiper<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">GIT RELATED ===</span>
<span style="color: #B388FF;">(</span>global-set-key <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"C-c C-g n"</span><span style="color: #9FA8DA;">)</span> 'git-gutter:next-hunk<span style="color: #B388FF;">)</span>
<span style="color: #B388FF;">(</span>global-set-key <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"C-c C-g p"</span><span style="color: #9FA8DA;">)</span> 'git-gutter:previous-hunk<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">GREP RELATED ===</span>
<span style="color: #B388FF;">(</span>global-set-key <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"C-M-g"</span><span style="color: #9FA8DA;">)</span> 'grep<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">Number Increment and Decrement ===</span>
<span style="color: #B388FF;">(</span>global-set-key <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"C-c +"</span><span style="color: #9FA8DA;">)</span> 'ced/increment-number-at-point<span style="color: #B388FF;">)</span>
<span style="color: #B388FF;">(</span>global-set-key <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"C-c -"</span><span style="color: #9FA8DA;">)</span> 'ced/decrement-number-at-point<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">My google translate function</span>
<span style="color: #B388FF;">(</span>global-set-key <span style="color: #66BB6A;">"\C-cg"</span> 'ced/google-translate-jp-en<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">mappings to swap lines ===</span>
<span style="color: #B388FF;">(</span>global-set-key
 <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"M-&lt;up&gt;"</span><span style="color: #9FA8DA;">)</span>
 <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">lambda</span> <span style="color: #00B8D4;">()</span>
   <span style="color: #00B8D4;">(</span><span style="color: #7E57C2;">interactive</span><span style="color: #00B8D4;">)</span>
   <span style="color: #00B8D4;">(</span>transpose-lines 1<span style="color: #00B8D4;">)</span>
   <span style="color: #00B8D4;">(</span>line-move -2<span style="color: #00B8D4;">)</span>
   <span style="color: #9FA8DA;">)</span>
 <span style="color: #B388FF;">)</span>

<span style="color: #B388FF;">(</span>global-set-key
 <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"M-&lt;down&gt;"</span><span style="color: #9FA8DA;">)</span>
 <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">lambda</span> <span style="color: #00B8D4;">()</span>
   <span style="color: #00B8D4;">(</span><span style="color: #7E57C2;">interactive</span><span style="color: #00B8D4;">)</span>
   <span style="color: #00B8D4;">(</span>line-move 1<span style="color: #00B8D4;">)</span>
   <span style="color: #00B8D4;">(</span>transpose-lines 1<span style="color: #00B8D4;">)</span>
   <span style="color: #00B8D4;">(</span>line-move -1<span style="color: #00B8D4;">)</span>
   <span style="color: #9FA8DA;">)</span>
 <span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">windows/splits related ===</span>
<span style="color: #B388FF;">(</span>global-set-key <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"C-x |"</span><span style="color: #9FA8DA;">)</span> 'toggle-window-split<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">White space mode! ===</span>
<span style="color: #B388FF;">(</span>global-set-key <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"C-c w"</span><span style="color: #9FA8DA;">)</span> 'whitespace-mode<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">my commenting ===</span>
<span style="color: #B388FF;">(</span>global-set-key <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"C-M-;"</span><span style="color: #9FA8DA;">)</span> 'ced/comment-line<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">insert-current-date-ymd &#38306;&#25968; ===</span>
<span style="color: #B388FF;">(</span>global-set-key <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"C-c t"</span><span style="color: #9FA8DA;">)</span> 'ced/insert-current-date-ymd<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">duplicate lines ===</span>
<span style="color: #B388FF;">(</span>global-set-key <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"C-d"</span><span style="color: #9FA8DA;">)</span> 'ced/duplicate-line<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">joining lines like in VIM ===</span>
<span style="color: #B388FF;">(</span>global-set-key <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"S-&lt;delete&gt;"</span><span style="color: #9FA8DA;">)</span> 'ced/join-lines<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">search and highlight like I do in Vim ===</span>
<span style="color: #B388FF;">(</span>global-set-key <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"C-c *"</span><span style="color: #9FA8DA;">)</span> 'ced/search-region<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">navigation related ===</span>
<span style="color: #B388FF;">(</span>global-set-key <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"C-:"</span><span style="color: #9FA8DA;">)</span> 'avy-goto-char<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">org related ===</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">list agenda</span>
<span style="color: #B388FF;">(</span>global-set-key <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"C-c a a"</span><span style="color: #9FA8DA;">)</span> 'org-agenda-list<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">List tasks</span>
<span style="color: #B388FF;">(</span>global-set-key <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"C-c a t"</span><span style="color: #9FA8DA;">)</span> 'org-todo-list<span style="color: #B388FF;">)</span>

</pre>
</div>
</div>
</div>
