emacs/init.org
** Completion/Hippie/Ido
Found on [[https://www.emacswiki.org/emacs/HippieExpand][Emacs Wiki]].

#+BEGIN_SRC emacs-lisp
  (defun my-hippie-expand-completions (&optional hippie-expand-function)
    "Return the full list of possible completions generated by `hippie-expand'.
      The optional argument can be generated with `make-hippie-expand-function'."
    (let ((this-command 'my-hippie-expand-completions)
		  (last-command last-command)
		  (buffer-modified (buffer-modified-p))
		  (hippie-expand-function (or hippie-expand-function 'hippie-expand)))
	  (while (progn
			   (funcall hippie-expand-function nil)
			   (setq last-command 'my-hippie-expand-completions)
			   (not (equal he-num -1)))))
    ;; Evaluating the completions modifies the buffer, however we will finish
    ;; up in the same state that we began.
    (set-buffer-modified-p buffer-modified)
    ;; Provide the options in the order in which they are normally generated.
    (delete he-search-string (reverse he-tried-table)))

  (defun my-ido-hippie-expand-with (hippie-expand-function)
    "Offer ido-based completion using the specified hippie-expand function."
    (let* ((options (my-hippie-expand-completions hippie-expand-function))
		   (selection (and options
						   (ido-completing-read "Completions: " options))))
	  (if selection
		  (he-substitute-string selection t)
	    (message "No expansion found"))))

  (defun my-ido-hippie-expand ()
    "Offer ido-based completion for the word at point."
    (interactive)
    (my-ido-hippie-expand-with 'hippie-expand))

  (global-set-key (kbd "M-/") 'my-ido-hippie-expand)
#+END_SRC
* System specific
** Windows
#+BEGIN_SRC emacs-lisp
(when (memq window-system '(w32))
  ;; sql-mode related
  ;; (setq sql-mysql-options '("-C" "-t" "-f" "-n"))
  (setq sql-mysql-options '("-C" "-t" "-f" "-n"))

  ;; ispell related (only used at home?)
  (add-to-list 'exec-path "C:/Program Files (x86)/Aspell/bin/")
  (setq ispell-program-name "aspell")
)
#+END_SRC

* Programing
** General
#+BEGIN_SRC emacs-lisp
;; ctags related
;; command : ctags -R -e --exclude=.svn --exclude=node_modules --exclude=_test --exclude=smarty --exclude="*.min.*" --langmap=php:.php.inc --PHP-kinds=+cf-v

(if (eq system-type 'darwin)
    ;; on Mac using a specific ctags installed with Homebrew
    (setq myctags-command "/usr/local/bin/ctags")
    ;; using the ctags commadn in the path of the system
    (setq myctags-command "ctags")
  )

;; Tabs related
(setq-default c-basic-offset 4 tab-width 4)
#+END_SRC
