emacs/init.html

<div id="outline-container-org867d48c" class="outline-3">
<h3 id="org867d48c"><span class="todo TODO">TODO</span> Completion/Hippie/Ido&#xa0;&#xa0;&#xa0;<span class="tag"><span class="fixme">fixme</span></span></h3>
<div class="outline-text-3" id="text-org867d48c">
<p>
Found on <a href="https://www.emacswiki.org/emacs/HippieExpand">Emacs Wiki</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">my-hippie-expand-completions</span> <span style="color: #9FA8DA;">(</span><span style="color: #D84315;">&amp;optional</span> hippie-expand-function<span style="color: #9FA8DA;">)</span>
  <span style="color: #78909C;">"Return the full list of possible completions generated by `</span><span style="color: #5C6BC0;">hippie-expand</span><span style="color: #78909C;">'.</span>
<span style="color: #78909C;">      The optional argument can be generated with `</span><span style="color: #5C6BC0;">make-hippie-expand-function</span><span style="color: #78909C;">'."</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">let</span> <span style="color: #00B8D4;">(</span><span style="color: #1E88E5;">(</span>this-command 'my-hippie-expand-completions<span style="color: #1E88E5;">)</span>
        <span style="color: #1E88E5;">(</span>last-command last-command<span style="color: #1E88E5;">)</span>
        <span style="color: #1E88E5;">(</span>buffer-modified <span style="color: #00897B;">(</span>buffer-modified-p<span style="color: #00897B;">)</span><span style="color: #1E88E5;">)</span>
        <span style="color: #1E88E5;">(</span>hippie-expand-function <span style="color: #00897B;">(</span><span style="color: #7E57C2;">or</span> hippie-expand-function 'hippie-expand<span style="color: #00897B;">)</span><span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span>
    <span style="color: #00B8D4;">(</span><span style="color: #7E57C2;">while</span> <span style="color: #1E88E5;">(</span><span style="color: #7E57C2;">progn</span>
             <span style="color: #00897B;">(</span>funcall hippie-expand-function nil<span style="color: #00897B;">)</span>
             <span style="color: #00897B;">(</span><span style="color: #7E57C2;">setq</span> last-command 'my-hippie-expand-completions<span style="color: #00897B;">)</span>
             <span style="color: #00897B;">(</span>not <span style="color: #EC407A;">(</span>equal he-num -1<span style="color: #EC407A;">)</span><span style="color: #00897B;">)</span><span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">Evaluating the completions modifies the buffer, however we will finish</span>
  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">up in the same state that we began.</span>
  <span style="color: #9FA8DA;">(</span>set-buffer-modified-p buffer-modified<span style="color: #9FA8DA;">)</span>
  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">Provide the options in the order in which they are normally generated.</span>
  <span style="color: #9FA8DA;">(</span>delete he-search-string <span style="color: #00B8D4;">(</span>reverse he-tried-table<span style="color: #00B8D4;">)</span><span style="color: #9FA8DA;">)</span><span style="color: #B388FF;">)</span>

<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">my-ido-hippie-expand-with</span> <span style="color: #9FA8DA;">(</span>hippie-expand-function<span style="color: #9FA8DA;">)</span>
  <span style="color: #78909C;">"Offer ido-based completion using the specified hippie-expand function."</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">let*</span> <span style="color: #00B8D4;">(</span><span style="color: #1E88E5;">(</span>options <span style="color: #00897B;">(</span>my-hippie-expand-completions hippie-expand-function<span style="color: #00897B;">)</span><span style="color: #1E88E5;">)</span>
         <span style="color: #1E88E5;">(</span>selection <span style="color: #00897B;">(</span><span style="color: #7E57C2;">and</span> options
                         <span style="color: #EC407A;">(</span>ido-completing-read <span style="color: #66BB6A;">"Completions: "</span> options<span style="color: #EC407A;">)</span><span style="color: #00897B;">)</span><span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span>
    <span style="color: #00B8D4;">(</span><span style="color: #7E57C2;">if</span> selection
        <span style="color: #1E88E5;">(</span>he-substitute-string selection t<span style="color: #1E88E5;">)</span>
      <span style="color: #1E88E5;">(</span>message <span style="color: #66BB6A;">"No expansion found"</span><span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span><span style="color: #9FA8DA;">)</span><span style="color: #B388FF;">)</span>

<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">my-ido-hippie-expand</span> <span style="color: #9FA8DA;">()</span>
  <span style="color: #78909C;">"Offer ido-based completion for the word at point."</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">interactive</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>my-ido-hippie-expand-with 'hippie-expand<span style="color: #9FA8DA;">)</span><span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">(global-set-key (kbd "M-/") 'my-ido-hippie-expand)</span>
</pre>
</div>

<p>
Seems broken, fix later.<br />
Back to normal for now:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #B388FF;">(</span>global-set-key <span style="color: #9FA8DA;">(</span>kbd <span style="color: #66BB6A;">"M-/"</span><span style="color: #9FA8DA;">)</span> 'hippie-expand<span style="color: #B388FF;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdea6dc2" class="outline-2">
<h2 id="orgdea6dc2">System specific</h2>
<div class="outline-text-2" id="text-orgdea6dc2">
</div><div id="outline-container-org8986b44" class="outline-3">
<h3 id="org8986b44">Windows</h3>
<div class="outline-text-3" id="text-org8986b44">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #B388FF;">(</span><span style="color: #7E57C2;">when</span> <span style="color: #9FA8DA;">(</span>memq window-system '<span style="color: #00B8D4;">(</span>w32<span style="color: #00B8D4;">)</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">sql-mode related</span>
  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">(setq sql-mysql-options '("-C" "-t" "-f" "-n"))</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">setq</span> sql-mysql-options '<span style="color: #00B8D4;">(</span><span style="color: #66BB6A;">"-C"</span> <span style="color: #66BB6A;">"-t"</span> <span style="color: #66BB6A;">"-f"</span> <span style="color: #66BB6A;">"-n"</span><span style="color: #00B8D4;">)</span><span style="color: #9FA8DA;">)</span>

  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">ispell related (only used at home?)</span>
  <span style="color: #9FA8DA;">(</span>add-to-list 'exec-path <span style="color: #66BB6A;">"C:/Program Files (x86)/Aspell/bin/"</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">setq</span> ispell-program-name <span style="color: #66BB6A;">"aspell"</span><span style="color: #9FA8DA;">)</span>
<span style="color: #B388FF;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1636e75" class="outline-2">
<h2 id="org1636e75">Programing</h2>
<div class="outline-text-2" id="text-org1636e75">
</div><div id="outline-container-org593d47b" class="outline-3">
<h3 id="org593d47b">General</h3>
<div class="outline-text-3" id="text-org593d47b">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">ctags related</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">command : ctags -R -e --exclude=.svn --exclude=node_modules --exclude=_test --exclude=smarty --exclude="*.min.*" --langmap=php:.php.inc --PHP-kinds=+cf-v</span>

<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">if</span> <span style="color: #9FA8DA;">(</span>eq system-type 'darwin<span style="color: #9FA8DA;">)</span>
    <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">on Mac using a specific ctags installed with Homebrew</span>
    <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">setq</span> myctags-command <span style="color: #66BB6A;">"/usr/local/bin/ctags"</span><span style="color: #9FA8DA;">)</span>
    <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">using the ctags commadn in the path of the system</span>
    <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">setq</span> myctags-command <span style="color: #66BB6A;">"ctags"</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">Tabs related</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq-default</span> c-basic-offset 4 tab-width 4<span style="color: #B388FF;">)</span>
</pre>
</div>
</div>
</div>
