emacs/init.org
** WEB related
#+BEGIN_SRC emacs-lisp
;; I like have some minor-modes always on by default
(add-hook 'web-mode-hook
		  (lambda ()

;;			(require 'ac-php)
;;			(require 'php-mode)
;;			(setq ac-sources  '(ac-source-php ) )
			(setq web-mode-enable-current-element-highlight t)
			
;;			(php-eldoc-enable)
			(emmet-mode)
			(rainbow-delimiters-mode)
		  ))

;;(add-hook 'css-mode-hook
;;		  (lambda ()
;;			(rainbow-mode 1)
;;			(local-set-key (kbd "TAB") 'company-css)
;;			))

(add-to-list 'auto-mode-alist '("\\.php$" . web-mode))
(add-to-list 'auto-mode-alist '("\\.tpl$" . web-mode))
(add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.css\\'" . css-mode))
(add-to-list 'auto-mode-alist '("\\.js$" . js2-mode))
#+END_SRC

** (e)Lisp related
#+BEGIN_SRC emacs-lisp
(autoload 'enable-paredit-mode "paredit" "Turn on pseudo-structural editing of Lisp code." t)

(eval-after-load "paredit"
  '(progn
	 (define-key paredit-mode-map (kbd "C-<left>") nil)
	 (define-key paredit-mode-map (kbd "C-<right>") nil)
	 ))

(defun lisp-like-init ()
  "Not only Elisp"
  (enable-paredit-mode)
  (rainbow-delimiters-mode)
  )

(defun elisp-init ()
  "Elisp specific"
  (eldoc-mode)
  )

(add-hook
 'emacs-lisp-mode-hook
 (lambda () (lisp-like-init) (elisp-init))
 )
#+END_SRC

