emacs/init.html
<div id="outline-container-org3ee25b7" class="outline-3">
<h3 id="org3ee25b7">WEB related</h3>
<div class="outline-text-3" id="text-org3ee25b7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">I like have some minor-modes always on by default</span>
<span style="color: #B388FF;">(</span>add-hook 'web-mode-hook
          <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">lambda</span> <span style="color: #00B8D4;">()</span>

<span style="color: #90A4AE;">;;</span><span style="color: #bebebe; font-style: italic;">          (require 'ac-php)</span>
<span style="color: #90A4AE;">;;</span><span style="color: #bebebe; font-style: italic;">          (require 'php-mode)</span>
<span style="color: #90A4AE;">;;</span><span style="color: #bebebe; font-style: italic;">          (setq ac-sources  '(ac-source-php ) )</span>
            <span style="color: #00B8D4;">(</span><span style="color: #7E57C2;">setq</span> web-mode-enable-current-element-highlight t<span style="color: #00B8D4;">)</span>
            
<span style="color: #90A4AE;">;;</span><span style="color: #bebebe; font-style: italic;">          (php-eldoc-enable)</span>
            <span style="color: #00B8D4;">(</span>emmet-mode<span style="color: #00B8D4;">)</span>
            <span style="color: #00B8D4;">(</span>rainbow-delimiters-mode<span style="color: #00B8D4;">)</span>
          <span style="color: #9FA8DA;">)</span><span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;;</span><span style="color: #bebebe; font-style: italic;">(add-hook 'css-mode-hook</span>
<span style="color: #90A4AE;">;;</span><span style="color: #bebebe; font-style: italic;">        (lambda ()</span>
<span style="color: #90A4AE;">;;</span><span style="color: #bebebe; font-style: italic;">          (rainbow-mode 1)</span>
<span style="color: #90A4AE;">;;</span><span style="color: #bebebe; font-style: italic;">          (local-set-key (kbd "TAB") 'company-css)</span>
<span style="color: #90A4AE;">;;</span><span style="color: #bebebe; font-style: italic;">          ))</span>

<span style="color: #B388FF;">(</span>add-to-list 'auto-mode-alist '<span style="color: #9FA8DA;">(</span><span style="color: #66BB6A;">"\\.php$"</span> . web-mode<span style="color: #9FA8DA;">)</span><span style="color: #B388FF;">)</span>
<span style="color: #B388FF;">(</span>add-to-list 'auto-mode-alist '<span style="color: #9FA8DA;">(</span><span style="color: #66BB6A;">"\\.tpl$"</span> . web-mode<span style="color: #9FA8DA;">)</span><span style="color: #B388FF;">)</span>
<span style="color: #B388FF;">(</span>add-to-list 'auto-mode-alist '<span style="color: #9FA8DA;">(</span><span style="color: #66BB6A;">"\\.html?\\'"</span> . web-mode<span style="color: #9FA8DA;">)</span><span style="color: #B388FF;">)</span>
<span style="color: #B388FF;">(</span>add-to-list 'auto-mode-alist '<span style="color: #9FA8DA;">(</span><span style="color: #66BB6A;">"\\.css\\'"</span> . css-mode<span style="color: #9FA8DA;">)</span><span style="color: #B388FF;">)</span>
<span style="color: #B388FF;">(</span>add-to-list 'auto-mode-alist '<span style="color: #9FA8DA;">(</span><span style="color: #66BB6A;">"\\.js$"</span> . js2-mode<span style="color: #9FA8DA;">)</span><span style="color: #B388FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd1f6d9b" class="outline-3">
<h3 id="orgd1f6d9b">(e)Lisp related</h3>
<div class="outline-text-3" id="text-orgd1f6d9b">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #B388FF;">(</span>autoload 'enable-paredit-mode <span style="color: #66BB6A;">"paredit"</span> <span style="color: #78909C;">"Turn on pseudo-structural editing of Lisp code."</span> t<span style="color: #B388FF;">)</span>

<span style="color: #B388FF;">(</span>eval-after-load <span style="color: #66BB6A;">"paredit"</span>
  '<span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">progn</span>
     <span style="color: #00B8D4;">(</span>define-key paredit-mode-map <span style="color: #1E88E5;">(</span>kbd <span style="color: #66BB6A;">"C-&lt;left&gt;"</span><span style="color: #1E88E5;">)</span> nil<span style="color: #00B8D4;">)</span>
     <span style="color: #00B8D4;">(</span>define-key paredit-mode-map <span style="color: #1E88E5;">(</span>kbd <span style="color: #66BB6A;">"C-&lt;right&gt;"</span><span style="color: #1E88E5;">)</span> nil<span style="color: #00B8D4;">)</span>
     <span style="color: #9FA8DA;">)</span><span style="color: #B388FF;">)</span>

<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">lisp-like-init</span> <span style="color: #9FA8DA;">()</span>
  <span style="color: #78909C;">"Not only Elisp"</span>
  <span style="color: #9FA8DA;">(</span>enable-paredit-mode<span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>rainbow-delimiters-mode<span style="color: #9FA8DA;">)</span>
  <span style="color: #B388FF;">)</span>

<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">elisp-init</span> <span style="color: #9FA8DA;">()</span>
  <span style="color: #78909C;">"Elisp specific"</span>
  <span style="color: #9FA8DA;">(</span>eldoc-mode<span style="color: #9FA8DA;">)</span>
  <span style="color: #B388FF;">)</span>

<span style="color: #B388FF;">(</span>add-hook
 'emacs-lisp-mode-hook
 <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">lambda</span> <span style="color: #00B8D4;">()</span> <span style="color: #00B8D4;">(</span>lisp-like-init<span style="color: #00B8D4;">)</span> <span style="color: #00B8D4;">(</span>elisp-init<span style="color: #00B8D4;">)</span><span style="color: #9FA8DA;">)</span>
 <span style="color: #B388FF;">)</span>
</pre>
</div>
</div>
</div>
</div>
