emacs/init.html

<div id="outline-container-orgbc75d47" class="outline-2">
<h2 id="orgbc75d47"><span class="todo TODO">TODO</span> Org related (big section)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cleanup">cleanup</span></span></h2>
<div class="outline-text-2" id="text-orgbc75d47">
<p>
Required packages:
</p>
<ul class="org-ul">
<li>org-bullets</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">hide source blocks by default</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">(setq org-hide-block-startup t)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">start org files in indent minor mode (a bit cleaner to look at)</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> org-startup-indented t<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">having code blocs in color in org files</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> org-src-fontify-natively t<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">no subscripts in tables (_ character) unless {} are used</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> org-export-with-sub-superscripts `{}<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">we export check boxes</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> org-html-checkbox-type 'html<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">we dont need the footer at html export</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> org-export-html-postamble nil<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">tasks entries</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> org-log-done t
      org-todo-keywords '<span style="color: #9FA8DA;">(</span><span style="color: #00B8D4;">(</span>sequence <span style="color: #66BB6A;">"TODO"</span> <span style="color: #66BB6A;">"WIP"</span> <span style="color: #66BB6A;">"ONHOLD"</span> <span style="color: #66BB6A;">"DONE"</span><span style="color: #00B8D4;">)</span><span style="color: #9FA8DA;">)</span>
      org-todo-keyword-faces '<span style="color: #9FA8DA;">(</span><span style="color: #00B8D4;">(</span><span style="color: #66BB6A;">"WIP"</span> . <span style="color: #1E88E5;">(</span><span style="color: #0097A7;">:foreground</span> <span style="color: #66BB6A;">"orange"</span> <span style="color: #0097A7;">:weight</span> bold<span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span> <span style="color: #00B8D4;">(</span><span style="color: #66BB6A;">"ONHOLD"</span> . <span style="color: #1E88E5;">(</span><span style="color: #0097A7;">:foreground</span> <span style="color: #66BB6A;">"orange"</span> <span style="color: #0097A7;">:weight</span> bold<span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span><span style="color: #9FA8DA;">)</span><span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">we insert relative link to files</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> org-link-file-path-type 'relative<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">we don't want the exported data in the kill ring</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> org-export-copy-to-kill-ring nil<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">default to 4 headlines of export</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> org-export-headline-levels 4<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">no numbers by default at export</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> org-export-with-section-numbers nil<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">no postamble by default</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> org-export-html-postamble nil<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">format for code blocks</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> org-src-preserve-indentation t<span style="color: #B388FF;">)</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> org-src-fontify-natively t<span style="color: #B388FF;">)</span>


<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">Disabling helm when setting tags in org &gt;&gt;&gt;</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">kk/org-set-tags-no-helm</span> <span style="color: #9FA8DA;">(</span>orig-func <span style="color: #D84315;">&amp;rest</span> args<span style="color: #9FA8DA;">)</span>
  <span style="color: #78909C;">"Run org-set-tags without helm."</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">if</span> <span style="color: #00B8D4;">(</span>boundp 'helm-mode<span style="color: #00B8D4;">)</span>
      <span style="color: #00B8D4;">(</span><span style="color: #7E57C2;">let</span> <span style="color: #1E88E5;">(</span><span style="color: #00897B;">(</span>orig-helm-mode helm-mode<span style="color: #00897B;">)</span><span style="color: #1E88E5;">)</span>
    <span style="color: #1E88E5;">(</span><span style="color: #7E57C2;">unwind-protect</span>
        <span style="color: #00897B;">(</span><span style="color: #7E57C2;">progn</span>
          <span style="color: #EC407A;">(</span>helm-mode 0<span style="color: #EC407A;">)</span>
          <span style="color: #EC407A;">(</span>apply orig-func args<span style="color: #EC407A;">)</span>
          <span style="color: #00897B;">)</span>
      <span style="color: #00897B;">(</span>helm-mode <span style="color: #EC407A;">(</span><span style="color: #7E57C2;">if</span> orig-helm-mode 1 0<span style="color: #EC407A;">)</span><span style="color: #00897B;">)</span><span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span>
    <span style="color: #00B8D4;">(</span>apply orig-func args<span style="color: #00B8D4;">)</span>
    <span style="color: #9FA8DA;">)</span><span style="color: #B388FF;">)</span>

<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">if</span> <span style="color: #9FA8DA;">(</span>not <span style="color: #00B8D4;">(</span>version&lt; emacs-version <span style="color: #66BB6A;">"24.4"</span><span style="color: #00B8D4;">)</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>advice-add 'org-set-tags <span style="color: #0097A7;">:around</span> 'kk/org-set-tags-no-helm<span style="color: #9FA8DA;">)</span><span style="color: #B388FF;">)</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">&lt;&lt;&lt;</span>


<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">Disabling ivy when setting tags in org &gt;&gt;&gt;</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">kk/org-set-tags-no-ivy</span> <span style="color: #9FA8DA;">(</span>orig-func <span style="color: #D84315;">&amp;rest</span> args<span style="color: #9FA8DA;">)</span>
  <span style="color: #78909C;">"Run org-set-tags without ivy."</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">if</span> <span style="color: #00B8D4;">(</span>boundp 'ivy-mode<span style="color: #00B8D4;">)</span>
      <span style="color: #00B8D4;">(</span><span style="color: #7E57C2;">let</span> <span style="color: #1E88E5;">(</span><span style="color: #00897B;">(</span>orig-ivy-mode ivy-mode<span style="color: #00897B;">)</span><span style="color: #1E88E5;">)</span>
    <span style="color: #1E88E5;">(</span><span style="color: #7E57C2;">unwind-protect</span>
        <span style="color: #00897B;">(</span><span style="color: #7E57C2;">progn</span>
          <span style="color: #EC407A;">(</span>ivy-mode 0<span style="color: #EC407A;">)</span>
          <span style="color: #EC407A;">(</span>apply orig-func args<span style="color: #EC407A;">)</span>
          <span style="color: #00897B;">)</span>
      <span style="color: #00897B;">(</span>ivy-mode <span style="color: #EC407A;">(</span><span style="color: #7E57C2;">if</span> orig-ivy-mode 1 0<span style="color: #EC407A;">)</span><span style="color: #00897B;">)</span><span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span>
    <span style="color: #00B8D4;">(</span>apply orig-func args<span style="color: #00B8D4;">)</span>
    <span style="color: #9FA8DA;">)</span><span style="color: #B388FF;">)</span>

<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">if</span> <span style="color: #9FA8DA;">(</span>not <span style="color: #00B8D4;">(</span>version&lt; emacs-version <span style="color: #66BB6A;">"24.4"</span><span style="color: #00B8D4;">)</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>advice-add 'org-set-tags <span style="color: #0097A7;">:around</span> 'kk/org-set-tags-no-ivy<span style="color: #9FA8DA;">)</span><span style="color: #B388FF;">)</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">&lt;&lt;&lt;</span>


<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">babel related &gt;&gt;&gt;</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">no auto export of blocks, it's heavy when 3 or 4 plantuml are present in the same document</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">it's better to C-c C-c the block manually to generate the result when needed...</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">only needed for org 8, since org 9 we need another method, see below</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">when</span>  <span style="color: #9FA8DA;">(</span>version&lt; <span style="color: #00B8D4;">(</span>org-version<span style="color: #00B8D4;">)</span> <span style="color: #66BB6A;">"9"</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">lambda</span> <span style="color: #00B8D4;">()</span>
    <span style="color: #00B8D4;">(</span><span style="color: #7E57C2;">setq</span> org-export-babel-evaluate nil<span style="color: #00B8D4;">)</span>
    <span style="color: #9FA8DA;">)</span>
<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">freely evaluation code in block_src in org files</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">setq</span> org-confirm-babel-evaluate nil<span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">support for shell command parameters in babel blocks</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">found at http://emacs.stackexchange.com/a/19301</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">require</span> '<span style="color: #5C6BC0;">ob-sh</span><span style="color: #B388FF;">)</span>
<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defadvice</span> <span style="color: #42A5F5;">org-babel-sh-evaluate</span> <span style="color: #9FA8DA;">(</span>around set-shell activate<span style="color: #9FA8DA;">)</span>
  <span style="color: #78909C;">"Add header argument :shcmd that determines the shell to be called."</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">let*</span> <span style="color: #00B8D4;">(</span><span style="color: #1E88E5;">(</span>org-babel-sh-command <span style="color: #00897B;">(</span><span style="color: #7E57C2;">or</span> <span style="color: #EC407A;">(</span>cdr <span style="color: #7E57C2;">(</span>assoc <span style="color: #0097A7;">:shcmd</span> params<span style="color: #7E57C2;">)</span><span style="color: #EC407A;">)</span> org-babel-sh-command<span style="color: #00897B;">)</span><span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span>
    ad-do-it
    <span style="color: #9FA8DA;">)</span><span style="color: #B388FF;">)</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">Other libs like obp-hp to use php in babel code blocks</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">(require 'gnuplot-mode)</span>
<span style="color: #B388FF;">(</span>org-babel-do-load-languages
 'org-babel-load-languages
 '<span style="color: #9FA8DA;">(</span><span style="color: #00B8D4;">(</span>emacs-lisp . t<span style="color: #00B8D4;">)</span> <span style="color: #00B8D4;">(</span>sql . t<span style="color: #00B8D4;">)</span> <span style="color: #00B8D4;">(</span>js . t<span style="color: #00B8D4;">)</span> <span style="color: #00B8D4;">(</span>plantuml . t<span style="color: #00B8D4;">)</span> <span style="color: #00B8D4;">(</span>sh . t<span style="color: #00B8D4;">)</span> <span style="color: #00B8D4;">(</span>ruby . t<span style="color: #00B8D4;">)</span> <span style="color: #00B8D4;">(</span>js . t<span style="color: #00B8D4;">)</span> <span style="color: #00B8D4;">(</span>elixir . t<span style="color: #00B8D4;">)</span><span style="color: #9FA8DA;">)</span><span style="color: #B388FF;">)</span> <span style="color: #90A4AE;">;</span><span style="color: #bebebe; font-style: italic;">(gnuplot . t)</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">&lt;&lt;&lt;</span>


<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">&gt;&gt;&gt;</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">prevents nilTODO to be exported in HTML for headlines with TODO keywords in the TOC</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">answer proposed on reddit: https://www.reddit.com/r/emacs/comments/46717x/orgmode_todo_html_export_in_toc/d042x40</span>

<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">(defun ced/org-html--todo (orig-func todo info)</span>
<span style="color: #90A4AE;">;;   </span><span style="color: #bebebe; font-style: italic;">"Format TODO keywords into HTML."</span>
<span style="color: #90A4AE;">;;   </span><span style="color: #bebebe; font-style: italic;">(when todo</span>
<span style="color: #90A4AE;">;;     </span><span style="color: #bebebe; font-style: italic;">(format "&lt;span class=\"%s %s%s\"&gt;%s&lt;/span&gt;"</span>
<span style="color: #90A4AE;">;;         </span><span style="color: #bebebe; font-style: italic;">(if (member todo org-done-keywords) "done" "todo")</span>
<span style="color: #90A4AE;">;;         </span><span style="color: #bebebe; font-style: italic;">(or (plist-get info :html-todo-kwd-class-prefix) "")</span>
<span style="color: #90A4AE;">;;             </span><span style="color: #bebebe; font-style: italic;">(org-html-fix-class-name todo)</span>
<span style="color: #90A4AE;">;;         </span><span style="color: #bebebe; font-style: italic;">todo)))</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">(if (not (version&lt; emacs-version "24.4"))</span>
<span style="color: #90A4AE;">;;   </span><span style="color: #bebebe; font-style: italic;">(advice-add 'org-html--todo :around 'ced/org-html--todo))</span>
<span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">&lt;&lt;&lt; NOT NEEDED IN LAST ORG VERSION (ok in my current version 9.0.9)</span>


<span style="color: #B388FF;">(</span><span style="color: #7E57C2;">defun</span> <span style="color: #42A5F5;">ced/org-mode-hook</span> <span style="color: #9FA8DA;">()</span>
<span style="color: #78909C;">"org-mode hook"</span>

  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">cute bullets</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">setq</span> org-bullets-bullet-list '<span style="color: #00B8D4;">(</span><span style="color: #66BB6A;">"&#9679;"</span> <span style="color: #66BB6A;">"&#9675;"</span> <span style="color: #66BB6A;">"&#9632;"</span> <span style="color: #66BB6A;">"&#9670;"</span> <span style="color: #66BB6A;">"&#9671;"</span> <span style="color: #66BB6A;">"&#9650;"</span><span style="color: #00B8D4;">)</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>org-bullets-mode<span style="color: #9FA8DA;">)</span>

  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">export code in color</span>
  <span style="color: #9FA8DA;">(</span><span style="color: #7E57C2;">require</span> '<span style="color: #5C6BC0;">htmlize</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #90A4AE;">;;</span><span style="color: #bebebe; font-style: italic;">(setq org-html-htmlize-output-type 'css)</span>

  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">flyspell in org mode files? Not so useful</span>
  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">(flyspell-mode 1)</span>

  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">allows , ' and " as a char in markup and not as a regex component</span>
  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">(like in ~g,~)</span>
  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">thery are removed from the list bellow</span>
  <span style="color: #9FA8DA;">(</span>setcar <span style="color: #00B8D4;">(</span>nthcdr 2 org-emphasis-regexp-components<span style="color: #00B8D4;">)</span> <span style="color: #66BB6A;">" \t\r\n"</span><span style="color: #9FA8DA;">)</span>
  <span style="color: #9FA8DA;">(</span>org-set-emph-re
   'org-emphasis-regexp-components
   org-emphasis-regexp-components<span style="color: #9FA8DA;">)</span>

  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">remapping a key to clear highlights</span>
  <span style="color: #9FA8DA;">(</span>define-key org-mode-map <span style="color: #00B8D4;">(</span>kbd <span style="color: #66BB6A;">"C-c &lt;SPC&gt;"</span><span style="color: #00B8D4;">)</span> 'lazy-highlight-cleanup<span style="color: #9FA8DA;">)</span>


  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">Exporting into HTML &gt;&gt;&gt;</span>
  <span style="color: #9FA8DA;">(</span>define-key org-mode-map <span style="color: #00B8D4;">(</span>kbd <span style="color: #66BB6A;">"&lt;f12&gt;"</span><span style="color: #00B8D4;">)</span> '<span style="color: #00B8D4;">(</span>lambda <span style="color: #1E88E5;">()</span>
                        <span style="color: #1E88E5;">(</span><span style="color: #7E57C2;">interactive</span><span style="color: #1E88E5;">)</span>
                        <span style="color: #1E88E5;">(</span>org-html-export-to-html<span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span>
    <span style="color: #9FA8DA;">)</span>

  <span style="color: #9FA8DA;">(</span>define-key org-mode-map <span style="color: #00B8D4;">(</span>kbd <span style="color: #66BB6A;">"C-&lt;f12&gt;"</span><span style="color: #00B8D4;">)</span> '<span style="color: #00B8D4;">(</span>lambda <span style="color: #1E88E5;">()</span>
                          <span style="color: #1E88E5;">(</span><span style="color: #7E57C2;">interactive</span><span style="color: #1E88E5;">)</span>
                          <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">only exports the current subtree</span>
                          <span style="color: #1E88E5;">(</span>org-html-export-to-html nil t<span style="color: #1E88E5;">)</span><span style="color: #00B8D4;">)</span>
    <span style="color: #9FA8DA;">)</span>
  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">&lt;&lt;&lt;</span>


  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">toggle images in org buffers</span>
  <span style="color: #9FA8DA;">(</span>define-key org-mode-map <span style="color: #00B8D4;">(</span>kbd <span style="color: #66BB6A;">"&lt;f11&gt;"</span><span style="color: #00B8D4;">)</span> 'org-toggle-inline-images<span style="color: #9FA8DA;">)</span>

  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">display image at point</span>
  <span style="color: #9FA8DA;">(</span>define-key org-mode-map <span style="color: #00B8D4;">(</span>kbd <span style="color: #66BB6A;">"C-&lt;f11&gt;"</span><span style="color: #00B8D4;">)</span> 'ced/org-image-display<span style="color: #9FA8DA;">)</span>

  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">store link function</span>
  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">Having a PROPERTIES drawer with a CUSTOM_ID is recommanded</span>
  <span style="color: #90A4AE;">;; </span><span style="color: #bebebe; font-style: italic;">C-c-x p to add a custom property into the current headline</span>
  <span style="color: #9FA8DA;">(</span>define-key org-mode-map <span style="color: #00B8D4;">(</span>kbd <span style="color: #66BB6A;">"C-c l"</span><span style="color: #00B8D4;">)</span> 'org-store-link<span style="color: #9FA8DA;">)</span>
<span style="color: #B388FF;">)</span>

<span style="color: #B388FF;">(</span>add-hook 'org-mode-hook 'ced/org-mode-hook<span style="color: #B388FF;">)</span>
</pre>
</div>
</div>
